DO ' DECLARE
BEGIN

IF NOT EXISTS (SELECT 1 FROM warehouses WHERE warehouse_id = 1) THEN
INSERT INTO warehouses(geo, address, name, delivery_zone)
VALUES
    (ST_SetSRID(ST_MakePoint(37.633737, 55.765396), 4326), ''Бобров переулок, 4'', ''Центр'', ST_Buffer(ST_SetSRID(ST_MakePoint(37.633737, 55.765396)::geography, 4326), 7000.0)::geometry),
    (ST_SetSRID(ST_MakePoint(37.630066, 55.661976), 4326), ''Каширское шоссе, 16'', ''Юг'', ST_Buffer(ST_SetSRID(ST_MakePoint(37.630066, 55.661976)::geography, 4326), 13500.0)::geometry),
    (ST_SetSRID(ST_MakePoint(37.414714, 55.751664), 4326), ''Рублёвское шоссе, 42'', ''Запад'', ST_Buffer(ST_SetSRID(ST_MakePoint(37.414714, 55.751664)::geography, 4236), 11000.0)::geometry),
    (ST_SetSRID(ST_MakePoint(37.617646, 55.848651), 4326), ''Берёзовая аллея, 12'', ''Север'', ST_Buffer(ST_SetSRID(ST_MakePoint(37.617646, 55.848651)::geography, 4236), 14000.0)::geometry),
    (ST_SetSRID(ST_MakePoint(37.738260, 55.754514), 4326), ''Шоссе Энтузиастов, 38'', ''Восток'', ST_Buffer(ST_SetSRID(ST_MakePoint(37.738260, 55.754514)::geography, 4236), 12500.0)::geometry);
END IF;
END;
' language plpgsql;

DO ' DECLARE
BEGIN

    /*
                USERS
    */
    IF NOT EXISTS (SELECT 1 FROM users WHERE user_id = 1) THEN
        INSERT INTO users
            VALUES  (1, ''ADMIN'', crypt(''adminadmin'', gen_salt(''bf'', 8)), ''Админов Админ Админович'', ''admin@mail.ru'', now(), null, null, null),
                    (2, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Aнтонов Антон Антонович'', ''antonov@mail.ru'', now(), null, null, null),
                    (3, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Иванов Иван Иванович'', ''ivanov@mail.ru'', now(), null, null, null),
                    (4, ''CLIENT'', crypt(''testtest'', gen_salt(''bf'', 8)), ''Тестов Тест Тестович'', ''test@mail.ru'', now(), null, null, null),
                    (5, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Князев Князь Князевич'', ''knyazev@mail.ru'', now(), null, null, null),
                    (6, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Климов Клим Климович'', ''klimov@mail.ru'', now(), null, null, null),
                    (7, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Петров Петр Петрович'', ''petrov@mail.ru'', now(), null, null, null),
                    (8, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Павлова Павла Павловна'', ''pavlova@mail.ru'', now(), null, null, null),
                    (9, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Евгенева Евгенья Евгеньевна'', ''evgeneva@mail.ru'', now(), null, null, null),
                    (10, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Александрова Александра Александровна'', ''aleksandrova@mail.ru'', now(), null, null, null),
                    (11, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Владиславова Владислава Владиславовна'', ''vladislavova@mail.ru'', now(), null, null, null),
                    (12, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Погорелов Зиновий Улебович'', ''pogorelov@mail.ru'', now(), null, null, null),
                    (13, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Евдокимов Леонтий Натанович'', ''evdokimov@mail.ru'', now(), null, null, null),
                    (14, ''CLIENT'', crypt(''testtest'', gen_salt(''bf'', 8)), ''Захаров Овидий Иванович'', ''zaharov@mail.ru'', now(), null, null, null),
                    (15, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Ершов Иван Альбертович'', ''ershov@mail.ru'', now(), null, null, null),
                    (16, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Никитин Нинель Фролович'', ''nikitin@mail.ru'', now(), null, null, null),
                    (17, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Дементьев Марк Михайлович'', ''dementev@mail.ru'', now(), null, null, null),
                    (18, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Зимин Даниил Дмитриевич'', ''zimin@mail.ru'', now(), null, null, null),
                    (19, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Беляев Давид Пётрович'', ''belyaev@mail.ru'', now(), null, null, null),
                    (20, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Фёдоров Альберт Никитевич'', ''fedorov@mail.ru'', now(), null, null, null),
                    (21, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Меркушев Роберт Феликсович'', ''merkushev@mail.ru'', now(), null, null, null),
                    (22, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Хохлов Ермак Алексеевич'', ''hohlov@mail.ru'', now(), null, null, null),
                    (23, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Комиссаров Азарий Владленович'', ''komissarov@mail.ru'', now(), null, null, null),
                    (24, ''CLIENT'', crypt(''testtest'', gen_salt(''bf'', 8)), ''Потапов Алан Семенович'', ''potapov@mail.ru'', now(), null, null, null),
                    (25, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Денисов Варлам Гордеевич'', ''denisov@mail.ru'', now(), null, null, null),
                    (26, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Сафонов Игнатий Эдуардович'', ''safonov@mail.ru'', now(), null, null, null),
                    (27, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Фомичёв Степан Авдеевич'', ''fomichev@mail.ru'', now(), null, null, null),
                    (28, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Лазарев Матвей Еремеевич'', ''lazarev@mail.ru'', now(), null, null, null),
                    (29, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Дорофеев Остап Артёмович'', ''dorofeev@mail.ru'', now(), null, null, null),
                    (30, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Бандурин Карл Семенович'', ''bandurin@mail.ru'', now(), null, null, null),
                    (31, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Фокин Герасим Давидович'', ''fokin@mail.ru'', now(), null, null, null),
                    (32, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Шестакова Снежана Макаровна'', ''shestakova@mail.ru'', now(), null, null, null),
                    (33, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Суханова Ирина Васильевна'', ''suhanova@mail.ru'', now(), null, null, null),
                    (34, ''CLIENT'', crypt(''testtest'', gen_salt(''bf'', 8)), ''Журавлёва Эдита Петровна'', ''zhuravleva Edita Petrovna@mail.ru'', now(), null, null, null),
                    (35, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Носова Жаклин Романовна'', ''nosova@mail.ru'', now(), null, null, null),
                    (36, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Фадеева Никки Руслановна'', ''fadeeva@mail.ru'', now(), null, null, null),
                    (37, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Воронцова Бронислава Улебовна'', ''voroncova@mail.ru'', now(), null, null, null),
                    (38, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Лыткина Юна Кирилловна'', ''lytkina@mail.ru'', now(), null, null, null),
                    (39, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Самсонова Инга Ярославовна'', ''samsonova@mail.ru'', now(), null, null, null),
                    (40, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Пахомова Дарьяна Тимуровна'', ''pahomova@mail.ru'', now(), null, null, null),
                    (41, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Крюкова Арина Борисовна'', ''kryukova@mail.ru'', now(), null, null, null),
                    (42, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Воробьёва Валентина Юрьевна'', ''vorobyova @mail.ru'', now(), null, null, null),
                    (43, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Доронина Мария Якуновна'', ''doronina@mail.ru'', now(), null, null, null),
                    (44, ''CLIENT'', crypt(''testtest'', gen_salt(''bf'', 8)), ''Кулакова Ксения Вадимовна'', ''kulakova@mail.ru'', now(), null, null, null),
                    (45, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Исакова Златослава Валерьевна'', ''isakova@mail.ru'', now(), null, null, null),
                    (46, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Волкова Азалия Еремеевна'', ''volkova@mail.ru'', now(), null, null, null),
                    (47, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Бирюкова Владлена Никитевна'', ''biryukova@mail.ru'', now(), null, null, null),
                    (48, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Маслова Динара Игнатьевна'', ''maslova@mail.ru'', now(), null, null, null),
                    (49, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Терентьева Аза Наумовна'', ''terenteva@mail.ru'', now(), null, null, null),
                    (50, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Сорокина Дарья Никитевна'', ''sorokina@mail.ru'', now(), null, null, null),
                    (51, ''CLIENT'', crypt(''password'', gen_salt(''bf'', 8)), ''Богданова Инга Глебовна'', ''bogdanova@mail.ru'', now(), null, null, null),
                    (52, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров Курьер Курьерович'', ''curierov@mail.ru'', now(), null, null, null),
                    (53, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров2 Курьер2 Курьерович2'', ''curierov2@mail.ru'', now(), null, null, null),
                    (54, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров3 Курьер3 Курьерович3'', ''curierov3@mail.ru'', now(), null, null, null),
                    (55, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров4 Курьер4 Курьерович4'', ''curierov4@mail.ru'', now(), null, null, null),
                    (56, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров5 Курьер5 Курьерович5'', ''curierov5@mail.ru'', now(), null, null, null),
                    (57, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров6 Курьер6 Курьерович6'', ''curierov6@mail.ru'', now(), null, null, null),
                    (58, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров7 Курьер7 Курьерович7'', ''curierov7@mail.ru'', now(), null, null, null),
                    (59, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров8 Курьер8 Курьерович8'', ''curierov8@mail.ru'', now(), null, null, null),
                    (60, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров9 Курьер9 Курьерович9'', ''curierov9@mail.ru'', now(), null, null, null),
                    (61, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров10 Курьер10 Курьерович10'', ''curierov10@mail.ru'', now(), null, null, null),
                    (62, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров11 Курьер11 Курьерович11'', ''curierov11@mail.ru'', now(), null, null, null),
                    (63, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров12 Курьер12 Курьерович12'', ''curierov12@mail.ru'', now(), null, null, null),
                    (64, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров13 Курьер13 Курьерович13'', ''curierov13@mail.ru'', now(), null, null, null),
                    (65, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров14 Курьер14 Курьерович14'', ''curierov14@mail.ru'', now(), null, null, null),
                    (66, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров15 Курьер15 Курьерович15'', ''curierov15@mail.ru'', now(), null, null, null),
                    (67, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров16 Курьер16 Курьерович16'', ''curierov16@mail.ru'', now(), null, null, null),
                    (68, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров17 Курьер17 Курьерович17'', ''curierov17@mail.ru'', now(), null, null, null),
                    (69, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров18 Курьер18 Курьерович18'', ''curierov18@mail.ru'', now(), null, null, null),
                    (70, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров19 Курьер19 Курьерович19'', ''curierov19@mail.ru'', now(), null, null, null),
                    (71, ''COURIER'', crypt(''password'', gen_salt(''bf'', 8)), ''Курьеров20 Курьер20 Курьерович20'', ''curierov20@mail.ru'', now(), null, null, null),
                    (72, ''MODERATOR'', crypt(''moderator'', gen_salt(''bf'', 8)), ''Модераторов Модератор Модераторович'', ''moderatorov@mail.ru'', now(), null, null, null),
                    (73, ''MODERATOR'', crypt(''moderator'', gen_salt(''bf'', 8)), ''Модераторов2 Модератор2 Модераторович2'', ''moderatorov2@mail.ru'', now(), null, null, null),
                    (74, ''MODERATOR'', crypt(''moderator'', gen_salt(''bf'', 8)), ''Модераторов3 Модератор3 Модераторович3'', ''moderatorov3@mail.ru'', now(), null, null, null),
                    (75, ''MODERATOR'', crypt(''moderator'', gen_salt(''bf'', 8)), ''Модераторов4 Модератор4 Модераторович4'', ''moderatorov4@mail.ru'', now(), null, null, null),
                    (76, ''MODERATOR'', crypt(''moderator'', gen_salt(''bf'', 8)), ''Модераторов5 Модератор5 Модераторович5'', ''moderatorov5@mail.ru'', now(), null, null, null),
                    (77, ''MODERATOR'', crypt(''moderator'', gen_salt(''bf'', 8)), ''Модераторов6 Модератор6 Модераторович6'', ''moderatorov6@mail.ru'', now(), null, null, null),
                    (78, ''MODERATOR'', crypt(''moderator'', gen_salt(''bf'', 8)), ''Модераторов7 Модератор7 Модераторович7'', ''moderatorov7@mail.ru'', now(), null, null, null),
                    (79, ''MODERATOR'', crypt(''moderator'', gen_salt(''bf'', 8)), ''Модераторов8 Модератор8 Модераторович8'', ''moderatorov8@mail.ru'', now(), null, null, null),
                    (80, ''MODERATOR'', crypt(''moderator'', gen_salt(''bf'', 8)), ''Модераторов9 Модератор9 Модераторович9'', ''moderatorov9@mail.ru'', now(), null, null, null),
                    (81, ''MODERATOR'', crypt(''moderator'', gen_salt(''bf'', 8)), ''Модераторов10 Модератор10 Модераторович10'', ''moderatorov10@mail.ru'', now(), null, null, null);

        ALTER SEQUENCE IF EXISTS users_user_id_seq RESTART WITH 81;
        END IF;
    END;
' language plpgsql;

DO ' DECLARE
BEGIN
    IF NOT EXISTS (SELECT 1 FROM files WHERE file_id = ''a3026e4e-02b0-4fc0-a92a-bdcdf064fa06'') THEN
    INSERT INTO files(file_id, owner_id, type, name, size, upload_date)
    VALUES
        (''848d58d4-a866-46f8-94fb-54406850627c'',	1,	''JPEG'',	''60-'',	159926,	''2022-04-01 21:51:59.133885''),
        (''a3026e4e-02b0-4fc0-a92a-bdcdf064fa06'',	1,	''PNG'',	''food'',	12522,	''2022-03-02 16:41:21.978782''),
        (''711ca2e7-bdd7-4250-b469-22d125a17961'',	1,	''PNG'',	''1-'',	305049,	''2022-04-01 21:18:32.247886''),
        (''341899c6-233b-4ac1-8b62-0325f80fcf2b'',	1,	''PNG'',	''2-'',	86509,	''2022-04-01 21:19:37.727889''),
        (''6d32bcf5-a4b4-4779-89f5-0cd693e17687'',	1,	''JPEG'',	''3-'',	101789,	''2022-04-01 21:20:13.930934''),
        (''a5e4fd94-8ef4-4a6d-8131-ebcfc09fc487'',	1,	''JPEG'',	''4-'',	32865,	''2022-04-01 21:21:10.99639''),
        (''226de6d4-a5a0-4565-8ab7-6f4d2be4e55f'',	1,	''PNG'',	''5-'',	462906,	''2022-04-01 21:21:36.725136''),
        (''d1d9f575-3bc0-48e9-bcaf-1347007a1f8c'',	1,	''PNG'',	''6-'',	406776,	''2022-04-01 21:22:02.913992''),
        (''840d0e37-da78-41dd-89c1-019a947faf76'',	1,	''PNG'',	''7-'',	326154,	''2022-04-01 21:22:41.634172''),
        (''70a92ed2-125d-4835-936b-2d00a6dde27b'',	1,	''PNG'',	''8-'',	1061838,	''2022-04-01 21:23:12.369525''),
        (''c2a1a158-e3e1-47c1-9970-f36f2fa007cd'',	1,	''PNG'',	''9-'',	448733,	''2022-04-01 21:23:39.959013''),
        (''1acb5e84-b2a6-4113-95fd-28721fb95d2f'',	1,	''PNG'',	''10-'',	139357,	''2022-04-01 21:24:13.26308''),
        (''63b532d8-619a-4bc4-aa23-893a4de41cc7'',	1,	''PNG'',	''11-'',	501201,	''2022-04-01 21:24:37.707632''),
        (''5f3a9b65-66c1-479f-84d6-91d7e42bdc63'',	1,	''PNG'',	''12-'',	242146,	''2022-04-01 21:25:02.586111''),
        (''addc0bb3-9e6e-432a-906d-7f6ad70c7d02'',	1,	''PNG'',	''13'',	2050958,	''2022-04-01 21:25:47.28765''),
        (''4a372f04-2f60-484b-9859-f880d10bffa0'',	1,	''PNG'',	''14-'',	239465,	''2022-04-01 21:26:12.637366''),
        (''ad04df8e-25fd-4b83-ad02-9b6f17c22b8b'',	1,	''PNG'',	''15-'',	209528,	''2022-04-01 21:26:56.983535''),
        (''c9f6b898-79ba-485e-b399-f968f1c5ff3d'',	1,	''PNG'',	''16-'',	194728,	''2022-04-01 21:27:26.563347''),
        (''6e2ff57d-1f11-4e39-87f0-1efca1fabb6a'',	1,	''JPEG'',	''17-'',	124128,	''2022-04-01 21:27:50.607327''),
        (''88b05075-5fab-4cf2-8e07-8542e58b3aa1'',	1,	''PNG'',	''18-'',	73076,	''2022-04-01 21:28:15.707444''),
        (''bd11175e-ca98-4459-b63e-db6c96ec83c0'',	1,	''PNG'',	''19-'',	658904,	''2022-04-01 21:28:41.100515''),
        (''5489a436-4392-43f2-8b94-6607d818eea7'',	1,	''PNG'',	''20-'',	252787,	''2022-04-01 21:29:08.404406''),
        (''7eb7c10c-8648-45ce-91e8-6c1f894764da'',	1,	''PNG'',	''21-'',	56977,	''2022-04-01 21:29:36.191116''),
        (''720ba697-6bd8-40cd-a7f6-9838b7feb280'',	1,	''JPEG'',	''22-'',	102878,	''2022-04-01 21:30:07.034292''),
        (''c5c1ed06-300b-4058-a6ca-4498c3fe93f5'',	1,	''PNG'',	''23-'',	312229,	''2022-04-01 21:30:41.242035''),
        (''2b6497fb-7d9b-4757-8083-0d020ed5d8ca'',	1,	''PNG'',	''24-'',	1833220,	''2022-04-01 21:31:07.132187''),
        (''83f7fac2-1d50-4500-9d8b-2671c8adbd94'',	1,	''PNG'',	''25-'',	85163,	''2022-04-01 21:31:31.939317''),
        (''76462f3a-c07a-4553-a593-ad4836520782'',	1,	''JPEG'',	''26-'',	44272,	''2022-04-01 21:31:55.526742''),
        (''9620ff77-7f7d-4350-8ea8-3921716da063'',	1,	''JPEG'',	''27-'',	55207,	''2022-04-01 21:32:24.0681''),
        (''d35bf1f7-fd17-4320-88b4-d511cfd5a243'',	1,	''PNG'',	''28-'',	634784,	''2022-04-01 21:33:30.001016''),
        (''17df9929-aa4e-4296-8c66-296eb820337c'',	1,	''PNG'',	''29-'',	135404,	''2022-04-01 21:34:08.316617''),
        (''1eb0278d-a6e3-46b3-92c5-26f7259d4409'',	1,	''PNG'',	''30-'',	168649,	''2022-04-01 21:34:33.612354''),
        (''70e30cbd-dd5e-466f-9303-1847878ae0aa'',	1,	''PNG'',	''31-'',	121864,	''2022-04-01 21:34:57.632558''),
        (''e0fd5d18-e6fe-4256-ad32-e88890ff0e4d'',	1,	''PNG'',	''32-'',	131047,	''2022-04-01 21:35:35.279703''),
        (''833edf64-f440-47b9-b740-40c78ff934a7'',	1,	''PNG'',	''33-'',	616269,	''2022-04-01 21:36:01.568277''),
        (''f3b5a6b5-d919-4c72-bf22-4c9642be4039'',	1,	''PNG'',	''34-'',	139011,	''2022-04-01 21:36:56.685054''),
        (''6ea427d4-0877-4fa3-a800-720dbb72e6e2'',	1,	''PNG'',	''35-'',	896320,	''2022-04-01 21:37:21.301896''),
        (''82856917-4bdd-4a24-b0e8-fbc7889a5513'',	1,	''PNG'',	''36-'',	117477,	''2022-04-01 21:37:44.754314''),
        (''35cacde0-c0f2-4848-a69d-d672411f4758'',	1,	''PNG'',	''37-'',	218758,	''2022-04-01 21:38:11.854632''),
        (''90e95240-66c4-4b03-9d81-460fa6f81786'',	1,	''JPEG'',	''38-'',	36279,	''2022-04-01 21:38:34.798058''),
        (''e6c9ed0b-c6fd-499c-841d-6939d9fe3249'',	1,	''PNG'',	''39-'',	84343,	''2022-04-01 21:39:32.135406''),
        (''fe099bdd-c6f3-43b6-839b-d943118c37c3'',	1,	''PNG'',	''40-'',	4008430,	''2022-04-01 21:39:57.673934''),
        (''0ecf3f10-bf3b-4d4b-890e-1ee35129d558'',	1,	''PNG'',	''41-'',	621085,	''2022-04-01 21:40:30.362562''),
        (''19e60804-4995-49af-acae-c389c33fb6fb'',	1,	''PNG'',	''42-'',	56921,	''2022-04-01 21:40:56.423243''),
        (''8c18778b-2ba1-4da4-85f6-f6e2af2d1433'',	1,	''PNG'',	''43-'',	101366,	''2022-04-01 21:41:20.80865''),
        (''e7037b83-d433-4046-ae9e-3d1badb71669'',	1,	''PNG'',	''44'',	245430,	''2022-04-01 21:41:45.084019''),
        (''5f0a8109-dc2b-4c93-b39b-59f67d6d8001'',	1,	''PNG'',	''45-'',	117620,	''2022-04-01 21:42:10.785063''),
        (''4ee6b492-12db-4dd5-9126-a40125fcbce1'',	1,	''PNG'',	''46-'',	230560,	''2022-04-01 21:42:37.92036''),
        (''0bd60c60-c796-46b0-ba61-43037ba796e7'',	1,	''JPEG'',	''47-'',	363863,	''2022-04-01 21:43:04.126804''),
        (''f0a6ff06-436d-4422-b90d-9198902244c0'',	1,	''JPEG'',	''48-'',	247568,	''2022-04-01 21:43:28.211565''),
        (''9fe6b989-8672-4666-9b57-8aaecee20502'',	1,	''PNG'',	''49-'',	421355,	''2022-04-01 21:44:08.3927''),
        (''7d59c3e5-4f44-4e75-93c6-920b55869059'',	1,	''JPEG'',	''50-'',	97855,	''2022-04-01 21:44:32.652855''),
        (''b2d3fdf1-b5cd-4ed7-94e7-013fc4a8e15f'',	1,	''PNG'',	''51-'',	203844,	''2022-04-01 21:45:00.49329''),
        (''9af34f86-badd-4b7b-9743-dd2dd8a9c85e'',	1,	''PNG'',	''52-'',	611913,	''2022-04-01 21:45:30.211451''),
        (''a3e32059-6026-44bb-8348-60818522d52d'',	1,	''PNG'',	''53-'',	924703,	''2022-04-01 21:46:43.984958''),
        (''d09adbea-c482-48ce-8e66-279c4b89fe31'',	1,	''PNG'',	''54-'',	189909,	''2022-04-01 21:47:12.607149''),
        (''c92414ae-435a-449e-a684-9f9b5d2918b4'',	1,	''JPEG'',	''55-'',	205019,	''2022-04-01 21:47:36.639903''),
        (''e9f92c88-2c52-478a-abef-b01d4de3ec13'',	1,	''PNG'',	''56-'',	90002,	''2022-04-01 21:49:49.613727''),
        (''f1ada3cb-8127-45e4-ab33-4e21a6f47611'',	1,	''JPEG'',	''57-'',	21541,	''2022-04-01 21:50:37.070922''),
        (''4ca6efc5-c9e4-4dd7-b634-793ef266996e'',	1,	''JPEG'',	''58-'',	18090,	''2022-04-01 21:51:01.33988''),
        (''c8df5779-dc23-4f47-a2b5-20340b5a7810'',	1,	''PNG'',	''59-'',	143780,	''2022-04-01 21:51:26.474629''),
        (''32770dc0-c990-4648-88bf-02ce74b58b29'',	1,	''JPEG'',	''61-'',	73471,	''2022-04-01 21:52:27.931941''),
        (''c73bf625-ead8-4c5b-a186-890599fa41d7'',	1,	''JPEG'',	''62-'',	72507,	''2022-04-01 21:52:56.499578''),
        (''3ef62a8b-22f5-4ba8-b5b3-65372d8be5f5'',	1,	''PNG'',	''63-'',	142395,	''2022-04-01 21:53:21.74213''),
        (''adfc38de-8c51-4a2e-842a-5c2876a98d50'',	1,	''PNG'',	''64-'',	1416784,	''2022-04-01 21:53:55.202755''),
        (''42543b06-8413-46c3-9bae-3199bfe05f0e'',	1,	''PNG'',	''65-'',	201181,	''2022-04-01 21:54:19.320615''),
        (''99a1aebe-d9c1-4abc-8db4-d16ccfe3300a'',	1,	''JPEG'',	''66-'',	57514,	''2022-04-01 21:54:41.404654''),
        (''a1c7a562-fe42-47e6-b341-67963bd1dfd1'',	1,	''JPEG'',	''67-'',	28481,	''2022-04-01 21:55:08.874899''),
        (''d235849e-1e87-4736-944b-50cb69b720c9'',	1,	''JPEG'',	''68-'',	80454,	''2022-04-01 21:55:38.355301''),
        (''f48e4ed1-1855-4e72-a47d-4d1cd4607f11'',	1,	''JPEG'',	''69'',	60492,	''2022-04-01 21:56:05.595382''),
        (''f822e874-0b30-4cfa-9c26-e815db3ff6b0'',	1,	''PNG'',	''70'',	542464,	''2022-04-01 21:56:29.977109''),
        (''8a7ac273-9541-44a9-ba3c-a8437698a6f1'',	1,	''PNG'',	''71-'',	4185148,	''2022-04-01 21:57:07.549379''),
        (''eed5cf86-6102-435d-b0ca-100b2434437f'',	1,	''PNG'',	''72-'',	653651,	''2022-04-01 21:57:36.668362''),
        (''d461d23d-e4fa-4c1f-9d78-0ab107cc03f3'',	1,	''JPEG'',	''73-'',	126452,	''2022-04-01 21:58:02.613729''),
        (''07731dfa-2150-499a-b23e-36dd147f679e'',	1,	''JPEG'',	''74-'',	56394,	''2022-04-01 21:58:27.740961''),
        (''7b1b170f-9071-43cb-8470-caa0ef1e71f7'',	1,	''JPEG'',	''75-'',	208334,	''2022-04-01 21:58:52.034041''),
        (''ce901f46-82d6-44b0-bec7-b94ac1abd395'',	1,	''PNG'',	''76-'',	341819,	''2022-04-01 21:59:20.173159''),
        (''2072cfab-45ed-48ef-b264-4bf36d3b582e'',	1,	''PNG'',	''77-'',	687366,	''2022-04-01 21:59:51.222416''),
        (''2f1c7d2f-9db7-4110-9c53-bb2f708c94d7'',	1,	''PNG'',	''78-'',	384128,	''2022-04-01 22:00:25.281956''),
        (''3996c3a6-d6f1-4931-8deb-53be2881177a'',	1,	''JPEG'',	''79-'',	471412,	''2022-04-01 22:00:53.530935''),
        (''2618d752-0a4c-4fa7-ae92-45a762c1d7a8'',	1,	''PNG'',	''80-'',	635958,	''2022-04-01 22:01:22.390761''),
        (''ddcdeca8-85f6-4c38-b112-d4cf8a0af677'',	1,	''JPEG'',	''81-'',	130642,	''2022-04-01 22:01:47.756976''),
        (''65c43cef-0001-4770-9465-46370b7136ca'',	1,	''PNG'',	''82'',	321735,	''2022-04-01 22:02:12.512497''),
        (''fe65f913-0a09-4a2e-b0e7-04b69feb4644'',	1,	''PNG'',	''83-'',	248215,	''2022-04-01 22:02:41.602674''),
        (''db6df62e-6c07-4043-9a7c-78c053f3d99b'',	1,	''JPEG'',	''84-'',	244006,	''2022-04-01 22:03:10.110037''),
        (''fab68281-758e-47d4-85a7-02d409c286f9'',	1,	''PNG'',	''85-'',	464427,	''2022-04-01 22:03:36.443513''),
        (''90cb3180-4865-4b61-b07c-06e68ab1b6ce'',	1,	''JPEG'',	''86-'',	105311,	''2022-04-01 22:05:25.076238''),
        (''f41340a3-0102-4452-a7eb-44082f92d15a'',	1,	''PNG'',	''87-'',	911199,	''2022-04-01 22:05:54.033915''),
        (''dc0ce6be-853b-45e1-9cc3-cced6ecaafac'',	1,	''PNG'',	''88-'',	936555,	''2022-04-01 22:06:16.149387''),
        (''19bef7ba-bc7d-4a53-93ed-899fbceb02aa'',	1,	''PNG'',	''89-'',	628453,	''2022-04-01 22:06:43.822965''),
        (''791ef4c8-529d-4dab-b2a9-54617ebc52ae'',	1,	''JPEG'',	''90-'',	48623,	''2022-04-01 22:07:08.055004''),
        (''3dbb6c93-2f31-44d9-95a0-bb2af467b669'',	1,	''JPEG'',	''91'',	289991,	''2022-04-01 22:07:31.684575''),
        (''43bee188-fdba-43e2-b362-064ea53df83a'',	1,	''PNG'',	''92-'',	446081,	''2022-04-01 22:07:55.80517''),
        (''8c4249d9-710b-4a9e-80de-9238c7e7129f'',	1,	''PNG'',	''93-'',	397861,	''2022-04-01 22:08:23.697566''),
        (''d83f7667-c022-4179-a2ce-392e6feabd86'',	1,	''PNG'',	''94-'',	697191,	''2022-04-01 22:08:52.526867''),
        (''d335c711-285e-4476-bc21-b8a783185960'',	1,	''PNG'',	''95-'',	599952,	''2022-04-01 22:09:17.246943''),
        (''773061e8-64c3-4f00-a9bf-3b4b7c86325a'',	1,	''PNG'',	''96-'',	664137,	''2022-04-01 22:09:45.082522''),
        (''5a258afb-72b5-4cc3-bc09-2482165bbcd3'',	1,	''PNG'',	''97-'',	878115,	''2022-04-01 22:10:11.484015''),
        (''93e2a8ea-4004-4154-a6d9-92cae3150d25'',	1,	''PNG'',	''98-'',	405185,	''2022-04-01 22:10:35.860509''),
        (''cb6ead5b-8962-46bc-84ad-f6f8b71b2f21'',	1,	''PNG'',	''99-'',	138452,	''2022-04-01 22:11:02.991232''),
        (''242f2340-caf4-414a-a467-848253a58286'',	1,	''PNG'',	''100-'',	193574,	''2022-04-01 22:11:31.311777''),
        (''56129265-bb54-4d81-a15c-51f3d0e63bca'',	1,	''PNG'',	''101-'',	98691,	''2022-04-01 22:11:56.130372''),
        (''efc0be2c-bb0c-4b5f-820b-2bf3c5fe7217'',	1,	''PNG'',	''102-'',	93357,	''2022-04-01 22:12:18.503912''),
        (''56c8fc7c-0877-41f1-8344-a7172ce3eb52'',	1,	''PNG'',	''103-'',	290624,	''2022-04-01 22:12:41.454482''),
        (''bc4982cc-5aec-4a8f-b3c8-093fbf418a83'',	1,	''PNG'',	''104-'',	910033,	''2022-04-01 22:13:05.201754''),
        (''2c463642-da6a-4568-944f-8e877e3bc808'',	1,	''JPEG'',	''105-'',	24060,	''2022-04-01 22:13:28.143094''),
        (''3dfbbe2e-dc25-4ef1-a6bc-264eaef74deb'',	1,	''PNG'',	''106-'',	94027,	''2022-04-01 22:13:52.107474''),
        (''a5023c36-40fd-42a7-b25c-43c7f4a12e92'',	1,	''PNG'',	''107-'',	258998,	''2022-04-01 22:14:19.252908''),
        (''b0b87353-ce6a-4926-8178-774f7d4fbb84'',	1,	''JPEG'',	''108-'',	188261,	''2022-04-01 22:14:42.256039''),
        (''80be37d3-aa92-43c2-87cc-0ffc38471b22'',	1,	''PNG'',	''109-'',	354371,	''2022-04-01 22:15:08.08903''),
        (''a00ee913-09a6-496f-9dd6-d6ef10454597'',	1,	''PNG'',	''110-'',	375081,	''2022-04-01 22:15:29.545827''),
        (''03ecb501-6e52-4da0-8fd9-f0adf6ed4365'',	1,	''PNG'',	''111-'',	269462,	''2022-04-01 22:16:02.483667''),
        (''73966b3f-9e3a-4c02-b034-8c87f0b32459'',	1,	''JPEG'',	''112-'',	136286,	''2022-04-01 22:16:27.927896''),
        (''64143396-1c41-4087-a80a-c68df965dec5'',	1,	''PNG'',	''113-'',	72599,	''2022-04-01 22:16:51.528015''),
        (''1fc8481f-80a6-410f-885a-5290540cf96f'',	1,	''JPEG'',	''114-'',	194674,	''2022-04-01 22:17:12.452623''),
        (''00cf340f-99cf-4d4e-b916-024b5e50b423'',	1,	''PNG'',	''115-'',	78452,	''2022-04-01 22:17:37.095252''),
        (''e604d950-987f-4dbc-91cd-b58c2552b0ca'',	1,	''JPEG'',	''116-'',	1180332, ''2022-04-01 22:17:59.48877''),
        (''c05e36f9-acc6-4528-ab9e-887fc62bc4f2'',	1,	''PNG'',	''117-'',	283664,	''2022-04-01 22:18:22.481032''),
        (''35dc3ae0-507f-463e-a217-8acf85a6f89d'',	1,	''PNG'',	''118-'',	80982,	''2022-04-01 22:18:49.63805''),
        (''1cff2b03-18db-413a-bd20-32f6f0152e24'',	1,	''PNG'',	''119-'',	80174,	''2022-04-01 22:19:18.542732''),
        (''941af6f0-0b7c-4369-8a66-72c8d74b7b81'',	1,	''PNG'',	''120-'',	70651,	''2022-04-01 22:20:19.716942''),
        (''c1594369-b084-46f9-bc1b-38adf9cf86a8'',	1,	''PNG'',	''121-'',	684178,	''2022-04-01 22:20:47.620485''),
        (''2b5c4886-093b-4054-8fd5-80a6751c1900'',	1,	''PNG'',	''user'',	114571,	''2022-04-01 22:56:41.391233'');
    END IF;
END;
' language plpgsql;

/*
    USERS SEARCH
*/
DO ' DECLARE
BEGIN
    IF NOT EXISTS (SELECT 1 FROM users_search WHERE user_search_id=1) THEN
        INSERT INTO users_search
            	SELECT u.user_id, setweight(to_tsvector(''russian'', u.email), ''A'') ||
            						  setweight(to_tsvector(''russian'', u.full_name), ''B'') ||
            						  setweight(to_tsvector(''russian'', u.role), ''C'') AS tsv
            	FROM users AS u;

    END IF;
END;
' language plpgsql;

    /*
                CLIENTS
    */
DO ' DECLARE
BEGIN
    IF NOT EXISTS (SELECT 1 FROM clients WHERE client_id = 2) THEN
            INSERT INTO clients
                VALUES  (2, null, ''+7 (910) 555-35-35'', 3.30),
                        (3, null, ''+7 (911) 555-35-35'', 5.00),
                        (4, null, ''+7 (912) 555-35-35'', 2.65),
                        (5, null, ''+7 (913) 555-35-35'', null),
                        (6, null, ''+7 (914) 555-35-35'', 1.25),
                        (7, null, ''+7 (915) 555-35-35'', 4.78),
                        (8, null, ''+7 (916) 555-35-35'', 4.91),
                        (9, null, ''+7 (917) 555-35-35'', 4.10),
                        (10, null, ''+7 (918) 555-35-35'', 4.97),
                        (11, null, ''+7 (919) 555-35-35'', 4.81),
                        (12, null, ''+7 (920) 555-35-35'', 3.30),
                        (13, null, ''+7 (921) 555-35-35'', 4.93),
                        (14, null, ''+7 (922) 555-35-35'', 4.79),
                        (15, null, ''+7 (923) 555-35-35'', null),
                        (16, null, ''+7 (924) 555-35-35'', 3.51),
                        (17, null, ''+7 (925) 555-35-35'', 4.72),
                        (18, null, ''+7 (926) 555-35-35'', 4.99),
                        (19, null, ''+7 (927) 555-35-35'', 4.93),
                        (20, null, ''+7 (928) 555-35-35'', 4.89),
                        (21, null, ''+7 (929) 555-35-35'', 4.95),
                        (22, null, ''+7 (930) 555-35-35'', 3.79),
                        (23, null, ''+7 (931) 555-35-35'', 4.80),
                        (24, null, ''+7 (932) 555-35-35'', 4.92),
                        (25, null, ''+7 (933) 555-35-35'', null),
                        (26, null, ''+7 (934) 555-35-35'', 4.83),
                        (27, null, ''+7 (935) 555-35-35'', 4.87),
                        (28, null, ''+7 (936) 555-35-35'', 4.88),
                        (29, null, ''+7 (937) 555-35-35'', 4.61),
                        (30, null, ''+7 (938) 555-35-35'', 4.74),
                        (31, null, ''+7 (939) 555-35-35'', 4.79),
                        (32, null, ''+7 (940) 555-35-35'', 3.30),
                        (33, null, ''+7 (941) 555-35-35'', 4.94),
                        (34, null, ''+7 (942) 555-35-35'', 0.00),
                        (35, null, ''+7 (943) 555-35-35'', null),
                        (36, null, ''+7 (944) 555-35-35'', 4.75),
                        (37, null, ''+7 (945) 555-35-35'', 4.12),
                        (38, null, ''+7 (946) 555-35-35'', 4.41),
                        (39, null, ''+7 (947) 555-35-35'', 4.36),
                        (40, null, ''+7 (948) 555-35-35'', 4.69),
                        (41, null, ''+7 (949) 555-35-35'', 4.88),
                        (42, null, ''+7 (950) 555-35-35'', 3.90),
                        (43, null, ''+7 (951) 555-35-35'', 5.00),
                        (44, null, ''+7 (952) 555-35-35'', 4.99),
                        (45, null, ''+7 (953) 555-35-35'', null),
                        (46, null, ''+7 (954) 555-35-35'', 4.94),
                        (47, null, ''+7 (955) 555-35-35'', 4.98),
                        (48, null, ''+7 (956) 555-35-35'', 4.53),
                        (49, null, ''+7 (957) 555-35-35'', 4.64),
                        (50, null, ''+7 (958) 555-35-35'', 4.89),
                        (51, null, ''+7 (959) 555-35-35'', 4.95);
        END IF;
END;
' language plpgsql;

    /*
                MODERATORS
    */
DO ' DECLARE
BEGIN
    IF NOT EXISTS (SELECT 1 FROM moderators WHERE moderator_id=72) THEN
        INSERT INTO moderators
            VALUES  (72, 1),
                    (73, 2),
                    (74, 3),
                    (75, 4),
                    (76, 5),
                    (77, null),
                    (78, null),
                    (79, null),
                    (80, null),
                    (81, null);
        END IF;
END;
' language plpgsql;

    /*
                PRODUCTS
    */
DO ' DECLARE
BEGIN
    IF NOT EXISTS (SELECT 1 FROM products WHERE product_id=1) THEN
        INSERT INTO products
        VALUES  (1, ''Молоко ультрапастеризованное 3,5%'',
                ''Производится путем ультрапастеризации.'',
                ''711ca2e7-bdd7-4250-b469-22d125a17961'', 950, ''Нормализованное молоко'', 270, TRUE, 120.50, 0),
                (2, ''Молоко пастеризованное 1,5%'',
                ''Производится из нормализованного молока, полученного с отборных ферм.'',
                ''341899c6-233b-4ac1-8b62-0325f80fcf2b'', 930, ''Цельное молоко'', 12, TRUE, 80.00, 0),
                (3, ''Молоко Безлактозное 1,5%'',
                ''Молоко обладает приятным сладковатым вкусом, отлично подойдет к чаю или кофе.'',
                ''6d32bcf5-a4b4-4779-89f5-0cd693e17687'', 970, ''Молоко нормализованное'', 180, TRUE, 110.00, 0),
                (4, ''Молоко Отборное 3,4%-4,5%'',
                ''Молоко, богатое белком, аминокислотами, кальцием и фосфором, обладает приятным вкусом.'',
                ''a5e4fd94-8ef4-4a6d-8131-ebcfc09fc487'', 1500, ''Цельное молоко'', 14, TRUE, 145.50, 0),
                (5, ''Творог рассыпчатый 5%'',
                ''Рассыпчатый творог отлично подходит для завтрака и легкого перекуса.'',
                ''226de6d4-a5a0-4565-8ab7-6f4d2be4e55f'', 320, ''Молоко, закваска.'', 21, TRUE, 138.00, 0),
                (6, ''Кефир 2,5%'',
                ''Изготовлен из молока и традиционной кефирной закваски.'',
                ''d1d9f575-3bc0-48e9-bcaf-1347007a1f8c'', 930, ''Сухое молоко, кефирная закваска.'', 14, TRUE, 83.90, 0),
                (7, ''Сметана 10%'',
                ''Про такие продукты говорят: Вкус детства'',
                ''840d0e37-da78-41dd-89c1-019a947faf76'', 180, ''Сливки, закваска.'', 30, TRUE, 37.90, 0),
                (8, ''Сметана 20%'',
                ''Продукт широко применяется для приготовления кондитерских изделий.'',
                ''70a92ed2-125d-4835-936b-2d00a6dde27b'', 180, ''Сливки, закваска.'', 30, TRUE, 54.90, 0),
                (9, ''Сметана 10%'',
                ''Про такие продукты говорят: Вкус детства'',
                ''c2a1a158-e3e1-47c1-9970-f36f2fa007cd'', 300, ''Сливки, закваска.'', 30, TRUE, 69.90, 0),
                (10, ''Сметана 20%'',
                ''Продукт широко применяется для приготовления кондитерских изделий.'',
                ''1acb5e84-b2a6-4113-95fd-28721fb95d2f'', 300, ''Сливки, закваска.'', 30, FALSE, 99.90, 0),
                (11, ''Традиционный творог 2%'',
                ''Из него получаются хорошие сырники, запеканки.'',
                ''63b532d8-619a-4bc4-aa23-893a4de41cc7'', 180, ''Сухое молоко, закваска.'', 14, TRUE, 82.90, 0),
                (12, ''Творожное зерно в сливках 7%'',
                ''Вкус у такого творога нежный, сливочный и совсем некислый.'',
                ''5f3a9b65-66c1-479f-84d6-91d7e42bdc63'', 130, ''Сухое молоко, закваска.'', 30, TRUE, 70.20, 0),
                (13, ''Сливки 10%'',
                ''Отлично подойдут к чаю или кофе.'',
                ''addc0bb3-9e6e-432a-906d-7f6ad70c7d02'', 20, ''Сливки нормализованные.'', 180, TRUE, 25.50, 0),
                (14, ''Сливки 20%'',
                ''Отлично подойдут к чаю или кофе.'',
                ''4a372f04-2f60-484b-9859-f880d10bffa0'', 200, ''Сливки нормализованные.'', 180, TRUE, 83.90, 0),
                (15, ''Сыр Тильзитер 45%'',
                ''Обладает пикантным вкусом, аппетитным сырным ароматом.'',
                ''ad04df8e-25fd-4b83-ad02-9b6f17c22b8b'', 180, ''Молоко, соль, уплотнитель, яйца, краситель, регулятор.'', 90, TRUE, 189.00, 0),
                (16, ''Сыр Сливочный 50%'',
                ''Обладает мягким сливочным вкусом, тонким сырным ароматом.'',
                ''c9f6b898-79ba-485e-b399-f968f1c5ff3d'', 180, ''Молоко, соль, уплотнитель, яйцаб, краситель, регулятор.'', 90, TRUE, 194.00, 0),
                (17, ''Масло сливочное 72,5%'',
                ''Подходит для приготовления бутербродов, каш, выпечки и соусов.'',
                ''6e2ff57d-1f11-4e39-87f0-1efca1fabb6a'', 180, ''Пастеризованные сливки.'', 35, TRUE, 190.00, 0),
                (18, ''Масло сливочное 82%'',
                ''Масло хорошо намазывается, подходит для приготовления бутербродов.'',
                ''88b05075-5fab-4cf2-8e07-8542e58b3aa1'', 180, ''Пастеризованные сливки.'', 35, TRUE, 203.00, 0),
                (19, ''Глазированный сырок c какао 23%'',
                ''Более плотная творожная масса отлично сочетается с новой глазурью и какао.'',
                ''bd11175e-ca98-4459-b63e-db6c96ec83c0'', 40, ''Творог, сахар, масло, глазурь, сухое молоко, какао-порошок.'', 30, TRUE, 27.90, 0),
                (20, ''Глазированный сырок со вкусом ванили 23%'',
                ''Более плотная* творожная масса отлично сочетается с новой глазурью и анильным вкусом сырка.'',
                ''5489a436-4392-43f2-8b94-6607d818eea7'', 40, ''Творог, сахар, масло, глазурь, сухое молоко, ароматизаторы.'', 30, FALSE, 29.90, 0),
                (21, ''Молочный коктейль со вкусом «шоколад» 2,5%'',
                ''Благодаря удобной упаковке с трубочкой – молочный коктейль можно взять с собой и насладится им.'',
                ''7eb7c10c-8648-45ce-91e8-6c1f894764da'', 210, ''Молоко, сахар, какао-порошок, стабилизатор, ароматизатор.'', 120, TRUE, 41.30, 0),
                (22, ''Молочный коктейль со вкусом клубника 2,5%'',
                ''Благодаря удобной упаковке с трубочкой – молочный коктейль можно взять с собой и насладится им.'',
                ''720ba697-6bd8-40cd-a7f6-9838b7feb280'', 210, ''Молоко, сахар, стабилизатор, ароматизатор, краситель.'', 120, TRUE, 41.30, 0),
                (23, ''Молоко сгущенное 8,5%'',
                ''Продукт обладает сладким вкусом и отлично подойдет для добавления в какао, кофе или чай.'',
                ''c5c1ed06-300b-4058-a6ca-4498c3fe93f5'', 400, ''Цельное молоко, сахароза, лактоза'', 365, TRUE, 152.90, 0),
                (24, ''Питьевой йогурт черника 2,5%'',
                ''100% натуральный и высокого качества.'',
                ''2b6497fb-7d9b-4757-8083-0d020ed5d8ca'', 930, ''Цельное молоко, загуститель, наполнитель Черника'', 25, TRUE, 87.50, 0),
                (25, ''Питьевой йогурт персик 2,5%'',
                ''100% натуральный и высокого качества.'',
                ''83f7fac2-1d50-4500-9d8b-2671c8adbd94'', 930, ''Цельное молоко, загуститель, наполнитель Персик'', 25, TRUE, 87.50, 0),
                (26, ''Питьевой йогурт клубника 2,5%'',
                ''100% натуральный и высокого качества.'',
                ''76462f3a-c07a-4553-a593-ad4836520782'', 930, ''Цельное молоко, загуститель, наполнитель Клубника'', 25, TRUE, 87.50, 0),
                 (27, ''Батон белый'',
                ''Белый хлеб в нарезке удобно использовать на своей кухне или взять с собой, например, на пикник.'',
                ''9620ff77-7f7d-4350-8ea8-3921716da063'', 355, ''Мука, вода, сахар, масло, стабилизатор.'', 5, TRUE, 39.70, 0),
                (28, ''Хлеб Бородинский'',
                ''Бородинский хлеб в нарезке удобно взять с собой.'',
                ''d35bf1f7-fd17-4320-88b4-d511cfd5a243'', 400, ''Мука ржаная, вода, патока, кориандр, тмин, масло, солод.'', 5, TRUE, 37.90, 0),
                (29, ''Хлеб Рижский заварной'',
                ''Натуральный заварной, подовый продукт. Прекрасно подойдет для первых и вторых блюд.'',
                ''17df9929-aa4e-4296-8c66-296eb820337c'', 350, ''Мука, вода, сахар, масло, соль, отруби, солод.'', 6, TRUE, 51.90, 0),
                (30, ''Яйцо куриное С0 10 штук'',
                ''Яйца куриные пищевые столовые Волжское утро С0 10шт. Цвет яйца: коричневое.'',
                ''1eb0278d-a6e3-46b3-92c5-26f7259d4409'', 750, ''Яйцо'', 25, FALSE, 96.90, 0),
                (31, ''Яйцо куриное С1 10 штук'',
                ''Яйца куриные пищевые столовые Волжское утро С1 10шт. Цвет яйца: коричневое.'',
                ''70e30cbd-dd5e-466f-9303-1847878ae0aa'', 650, ''Яйцо'', 25, TRUE, 86.90, 0),
                (32, ''Сахар белый'',
                ''Сахар белый'',
                ''e0fd5d18-e6fe-4256-ad32-e88890ff0e4d'', 1000, ''Сахар белый'', 270, TRUE, 62.80, 0),
                (33, ''Сахар тростниковый'',
                ''Изысканный вид тростникового сахара обладающий ярко выраженным карамельным ароматом и вкусом.'',
                ''833edf64-f440-47b9-b740-40c78ff934a7'', 900, ''Сахар белый'', null, TRUE, 254.00, 0),
                (34, ''Сахар рафинад 500г'',
                ''Сахар быстрорастворимый кубиками.'',
                ''f3b5a6b5-d919-4c72-bf22-4c9642be4039'', 500, ''Сахар белый'', 1825, TRUE, 44.90, 0),
                (35, ''Сахар рафинад 1кг'',
                ''Сахар быстрорастворимый кубиками.'',
                ''6ea427d4-0877-4fa3-a800-720dbb72e6e2'', 100, ''Сахар белый'', 1825, TRUE, 68.70, 0),
                (36, ''Картофель Россия'',
                ''Картофель для любых блюд от супов до салатов и пирожков'',
                ''82856917-4bdd-4a24-b0e8-fbc7889a5513'', 2300, ''Картофель'', 21, TRUE, 137.25, 0),
                (37, ''Картофель мытый'',
                ''Благодаря достаточно плотной структуре он не рассыпается, а также сохраняет свой вкус и аромат.'',
                ''35cacde0-c0f2-4848-a69d-d672411f4758'', 2500, ''Картофель'', 30, TRUE, 269.90, 0),
                (38, ''Капуста белокочанная'',
                ''Сочная, хрустящая белокочанная капуста для супов, салатов, жарки и консервирования.'',
                ''90e95240-66c4-4b03-9d81-460fa6f81786'', 2000, ''Капуста'', 25, TRUE, 93.80, 0),
                (39, ''Огурцы корнишоны премиум'',
                ''Огурцы корнишоны премиум 300 г. Год урожая 2021.'',
                ''e6c9ed0b-c6fd-499c-841d-6939d9fe3249'', 300, ''Огурец'', 14, TRUE, 149.90, 0),
                (40, ''Огурцы'',
                ''Мякоть сладкая и хрустящая. В некоторых случаях может ощущаться небольшой вяжущий вкус.'',
                ''fe099bdd-c6f3-43b6-839b-d943118c37c3'', 600, ''Огурец'', 14, FALSE, 129.90, 0),
                (41, ''Огурцы среднеплодные гладкие'',
                ''Легкий аромат и приятный вкус. Этот сорт огурцов может долго храниться.'',
                ''0ecf3f10-bf3b-4d4b-890e-1ee35129d558'', 600, ''Огурец'', 21, TRUE, 109.90, 0),
                (42, ''Томаты Черри на ветке'',
                ''Особенный сорт, который вы сразу узнаете по ярко выраженной сладости.'',
                ''19e60804-4995-49af-acae-c389c33fb6fb'', 300, ''Томат'', 21, TRUE, 179.90, 0),
                (43, ''Томаты сливовидные'',
                ''Томат сливовидной формы, характеризуется сочной, мясистой структурой и ярко-красным цветом.'',
                ''8c18778b-2ba1-4da4-85f6-f6e2af2d1433'', 485, ''Томат'', 14, TRUE, 129.90, 0),
                (44, ''Томаты розовые'',
                ''Розовые томаты имеют не только красивый внешний вид, но и очень приятный сладкий вкус.'',
                ''e7037b83-d433-4046-ae9e-3d1badb71669'', 700, ''Томат'', 15, TRUE, 269.90, 0),
                (45, ''Морковь'',
                ''Является универсальным ингредиентом, благодаря которому блюда приобретают особенную сладость.'',
                ''5f0a8109-dc2b-4c93-b39b-59f67d6d8001'', 500, ''Морковь'', 15, TRUE, 30.90, 0),
                (46, ''Морковь мытая'',
                ''Чистая, сочная, вкусная.'',
                ''4ee6b492-12db-4dd5-9126-a40125fcbce1'', 1000, ''Морковь'', 14, TRUE, 99.90, 40.00),
                (47, ''Свекла молодая'',
                ''Год урожая 2021. Хранить при температуре от +2 до +8 С.'',
                ''0bd60c60-c796-46b0-ba61-43037ba796e7'', 800, ''Свекла'', 45, TRUE, 55.90, 0),
                (48, ''Свекла крупная'',
                ''Из свеклы готовят борщи, запеканки, винегреты и даже десерты.'',
                ''f0a6ff06-436d-4422-b90d-9198902244c0'', 1500, ''Свекла'', 45, TRUE, 50.85, 0),
                (49, ''Редис'',
                ''Корнеплоды покрыты тонкой кожицей красного цвета и обладают острым пряным вкусом.'',
                ''9fe6b989-8672-4666-9b57-8aaecee20502'', 500, ''Редис'', 30, TRUE, 99.90, 0),
                (50, ''Лук репчатый'',
                ''Крупные луковицы. Год урожая 2021.'',
                ''7d59c3e5-4f44-4e75-93c6-920b55869059'', 1000, ''Лук'', 20, FALSE, 34.90, 0),
                (51, ''Лук ялтинский'',
                ''Ялтинский лук - это ровные плоские фиолетово-красные луковицы с белой мякотью.'',
                ''b2d3fdf1-b5cd-4ed7-94e7-013fc4a8e15f'', 420, ''Лук'', 20, TRUE, 119.90, 0),
                (52, ''Лук зеленый свежий'',
                ''Яркие свежие зеленые побеги репчатого лука придадут пикантный аромат.'',
                ''9af34f86-badd-4b7b-9743-dd2dd8a9c85e'', 100, ''Лук'', 14, TRUE, 79.90, 0),
                (53, ''Лук порей'',
                ''Лук-порей – самый необычный среди всех луков, отличающийся плоскими, лентовидными листьями.'',
                ''a3e32059-6026-44bb-8348-60818522d52d'', 800, ''Лук'', 14, TRUE, 263.90, 0),
                (54, ''Чеснок'',
                ''Чеснок используют в пищу в сыром виде, приготовленным в составе блюд и в качестве приправы.'',
                ''d09adbea-c482-48ce-8e66-279c4b89fe31'', 110, ''Чеснок'', 30, TRUE, 49.90, 0),
                (55, ''Чеснок Фермерский'',
                ''Ценят за острый пикантный аромат и вкус, которые так важны для приготовления многих блюд.'',
                ''c92414ae-435a-449e-a684-9f9b5d2918b4'', 160, ''Чеснок'', 25, TRUE, 199.90, 0),
                (56, ''Перец красный'',
                ''Перец можно эффектно подать в салатах и холодных закусках.'',
                ''e9f92c88-2c52-478a-abef-b01d4de3ec13'', 400, ''Перец'', 14, TRUE, 169.90, 0),
                (57, ''Перец желтый'',
                ''Перец можно эффектно подать в салатах и холодных закусках.'',
                ''f1ada3cb-8127-45e4-ab33-4e21a6f47611'', 400, ''Перец'', 14, TRUE, 169.90, 0),
                (58, ''Перец светофор'',
                ''Состав набора из 3-х перцев включает в себя перцы желтого, зеленого, красного цветов.'',
                ''4ca6efc5-c9e4-4dd7-b634-793ef266996e'', 660, ''Перец'', 30, TRUE, 199.90, 0),
                (59, ''Груша Форелл'',
                ''Этот сорт считается одним из самых красивых и ароматных.'',
                ''c8df5779-dc23-4f47-a2b5-20340b5a7810'', 500, ''Груша'', 7, TRUE, 185.00, 0),
                (60, ''Груша Конференция'',
                ''Классика мировой селекции английского происхождения.'',
                ''848d58d4-a866-46f8-94fb-54406850627c'', 500, ''Груша'', 7, FALSE, 175.00, 0),
                (61, ''Груша Санта Мария'',
                ''Спелые груши настолько сладкие и мягкие, что практически тают во рту.'',
                ''32770dc0-c990-4648-88bf-02ce74b58b29'', 500, ''Груша'', 30, TRUE, 129.90, 0),
                (62, ''Яблоки сезонные'',
                ''Сезонные яблоки отлично подойдут для шарлотки, повидла и начинки для пирогов.'',
                ''c73bf625-ead8-4c5b-a186-890599fa41d7'', 700, ''Яблоко'', 30, TRUE, 109.90, 40.00),
                (63, ''Яблоки Гала'',
                ''Яблоки Гала имеют умеренно сладкую мякоть, а также достаточно тонкую кожуру.'',
                ''3ef62a8b-22f5-4ba8-b5b3-65372d8be5f5'', 700, ''Яблоко'', 30, TRUE, 84.90, 0),
                (64, ''Яблоки Голден'',
                ''Имеют бледно-зеленый окрас, упругую сочную мякоть и насыщенным сладким вкусом.'',
                ''adfc38de-8c51-4a2e-842a-5c2876a98d50'', 700, ''Яблоко'', 30, TRUE, 119.90, 0),
                (65, ''Яблоки Гренни смит'',
                ''Имеют зеленый окрас, отличаются сладким вкусом с ярко выраженной кислинкой.'',
                ''42543b06-8413-46c3-9bae-3199bfe05f0e'', 700, ''Яблоко'', 30, TRUE, 99.90, 0),
                (66, ''Бананы желтые'',
                ''Желтые бананы обладают нежным сладким вкусом.'',
                ''99a1aebe-d9c1-4abc-8db4-d16ccfe3300a'', 1000, ''Банан'', 10, TRUE, 77.99, 0),
                (67, ''Бананы зеленые'',
                ''Идеальные бананы для тех, кто выкусывает из зрелых фруктов коричневые места.'',
                ''a1c7a562-fe42-47e6-b341-67963bd1dfd1'', 2000, ''Банан'', 15, TRUE, 141.80, 0),
                (68, ''Виноград Тайфи'',
                ''Все ягодки как на подбор. Год урожая 2021.'',
                ''d235849e-1e87-4736-944b-50cb69b720c9'', 500, ''Виноград'', 14, TRUE, 149.90, 35.90),
                (69, ''Виноград Киш-Миш белый'',
                ''Сладкий десертный виноград с некрупными ягодами, в которых нет косточек.'',
                ''f48e4ed1-1855-4e72-a47d-4d1cd4607f11'', 500, ''Виноград'', 14, TRUE, 189.90, 80.90),
                (70, ''Виноград красный'',
                ''Ягоды крупные, мясистые, сладкие с тонкой шкуркой.'',
                ''f822e874-0b30-4cfa-9c26-e815db3ff6b0'', 500, ''Виноград'', 14, FALSE, 179.90, 40.00),
                (71, ''Виноград черный'',
                ''Удивительный по вкусу, цвету, форме и полезным веществам, продукт природы.'',
                ''8a7ac273-9541-44a9-ba3c-a8437698a6f1'', 500, ''Виноград'', 10, TRUE, 149.90, 30.00),
                (72, ''Мандарины'',
                ''Долго хранится в домашних условиях. Фрукты, богатые витамином С и микроэлементами.'',
                ''eed5cf86-6102-435d-b0ca-100b2434437f'', 800, ''Мандарин'', 30, TRUE, 189.90, 0),
                (73, ''Апельсины'',
                ''Пектины, которые содержатся в апельсинах, способствуют процессу пищеварения.'',
                ''d461d23d-e4fa-4c1f-9d78-0ab107cc03f3'', 1000, ''Апельсин'', 20, TRUE, 169.90, 0),
                (74, ''Фасоль красная'',
                ''Продукт не содержит консервантов. Без ГМО.'',
                ''07731dfa-2150-499a-b23e-36dd147f679e'', 400, ''Фасоль красная, пряная заливка, хлорид кальция.'', 1450, TRUE, 118.00, 00.00),
                (75, ''Фасоль белая'',
                ''Продукт не содержит консервантов. Без ГМО.'',
                ''7b1b170f-9071-43cb-8470-caa0ef1e71f7'', 400, ''Фасоль белая, пряная заливка, хлорид кальция.'', 1450, TRUE, 99.90, 00.00),
                (76, ''Горох желтый'',
                ''Горох колотый не требует замачивания.'',
                ''ce901f46-82d6-44b0-bec7-b94ac1abd395'', 900, ''Горох'', 545, TRUE, 75.50, 0),
                (77, ''Рис круглозерный'',
                ''Рекомендуется для тех кто любит мягкий рис.'',
                ''2072cfab-45ed-48ef-b264-4bf36d3b582e'', 900, ''Рис'', 360, TRUE, 110.00, 17.00),
                (78, ''Рис длиннозерный'',
                ''Первый сорт. Не содержит ГМО.'',
                ''2f1c7d2f-9db7-4110-9c53-bb2f708c94d7'', 900, ''Рис'', 360, TRUE, 115.00, 0),
                (79, ''Гречка ядрица'',
                ''Обладает коричневым цветом и приятным ароматом при варке.'',
                ''3996c3a6-d6f1-4931-8deb-53be2881177a'', 900, ''Греча'', 360, TRUE, 150.00, 31.00),
                (80, ''Гречка Экстра ядрица'',
                ''Обладает коричневым цветом и приятным ароматом при варке.'',
                ''2618d752-0a4c-4fa7-ae92-45a762c1d7a8'', 900, ''Греча'', 360, FALSE, 143.00, 0),
                (81, ''Макаронные изделия улитки'',
                ''Изогнутые короткие «улитки» хороши тем, что удерживают соус внутри.'',
                ''ddcdeca8-85f6-4c38-b112-d4cf8a0af677'', 450, ''Мука, вода питьевая'', 730, TRUE, 62.00, 0),
                (82, ''Макаронные изделия перышки'',
                ''Короткие гладкие перышки можно использовать в любых блюдах.'',
                ''65c43cef-0001-4770-9465-46370b7136ca'', 450, ''Мука, вода питьевая'', 730, TRUE, 71.10, 0),
                (83, ''Мука пшеничная высший сорт'',
                ''Подходит для приготовления хлеба, бисквитов, а также в качестве загустителя для соусов.'',
                ''fe65f913-0a09-4a2e-b0e7-04b69feb4644'', 1000, ''Мука'', 365, TRUE, 59.00, 0),
                (84, ''Мука кондитерская'',
                ''Основа легкой выпечки.'',
                ''db6df62e-6c07-4043-9a7c-78c053f3d99b'', 1000, ''Мука'', 365, TRUE, 79.90, 0),
                (85, ''Соль Экстра поваренная пищевая'',
                ''Сорт экстра выварочная.'',
                ''fab68281-758e-47d4-85a7-02d409c286f9'', 1000, ''Хлористый натрий, Е536'', 730, TRUE, 22.00, 0),
                (86, ''Соль морская йодированная'',
                ''В отличие от каменной соли, морская соль содержит больше минералов, что придаст блюдам изысканный вкус.'',
                ''90cb3180-4865-4b61-b07c-06e68ab1b6ce'', 500, ''Хлористый натрий, Е536'', 730, TRUE, 64.40, 0),
                (87, ''Перец Черный молотый'',
                ''Черный перец называют королем пряностей.'',
                ''f41340a3-0102-4452-a7eb-44082f92d15a'', 20, ''Перец'', 1100, TRUE, 56.90, 11.00),
                (88, ''Перец Черный горошек'',
                ''Черный перец называют королем пряностей.'',
                ''dc0ce6be-853b-45e1-9cc3-cced6ecaafac'', 20, ''Перец'', 1100, TRUE, 56.90, 11.00),
                (89, ''Конфеты Батончики'',
                ''Нежные конфеты с арахисовым вкусом особенно хороши к кофе, сваренному в турке.'',
                ''19bef7ba-bc7d-4a53-93ed-899fbceb02aa'', 250, ''Сахар, арахис тертый, жир, вафли, ароматизатор.'', 210, TRUE, 130.00, 5.00),
                (90, ''Конфеты Птичье молоко'',
                ''Под шоколадной глазурью — нежное суфле с едва уловимой кислинкой и сливочным ароматом.'',
                ''791ef4c8-529d-4dab-b2a9-54617ebc52ae'', 225, ''Глазурь, какао-порошок, жир, патока, белок сухой.'', 180, FALSE, 150.00, 11.00),
                (91, ''Карамель Москвичка'',
                ''Карамель с ликерной начинкой, покрытая аппетитной шоколадной глазурью.'',
                ''3dbb6c93-2f31-44d9-95a0-bb2af467b669'', 225, ''Глазурь, сахар, ароматизатор, патока, сгущенка.'', 180, TRUE, 125.00, 15.00),
                (92, ''Печенье Юбилейное'',
                ''Десерт обладает выраженным молочным вкусом и ароматом, имеет мягкое послевкусие.'',
                ''43bee188-fdba-43e2-b362-064ea53df83a'', 313, ''Мука, сахар, масло, вода, сироп, крахмал, яйца.'', 270, TRUE, 75.40, 0),
                (93, ''Печенье Овсяное'',
                ''Традиционные рецепты и новейшие технологии — секрет вкуса и качества.'',
                ''8c4249d9-710b-4a9e-80de-9238c7e7129f'', 400, ''Мука овсяная, сахар, масло, вода, изюм, яйца.'', 90, TRUE, 117.00, 0),
                (94, ''Печенье Курабье'',
                ''Традиционные рецепты и новейшие технологии — секрет вкуса и качества.'',
                ''d83f7667-c022-4179-a2ce-392e6feabd86'', 250, ''Мука, маргарин, сахар, вода, повидло, яйца.'', 30, TRUE, 96.60, 0),
                (95, ''Чай черный 25 пакетиков'',
                ''Отличается идеально сбалансированным мягким вкусом с тонкими пряными оттенками.'',
                ''d335c711-285e-4476-bc21-b8a783185960'', 90, ''Чай черный байховый цейлонский.'', 1100, TRUE, 129.90, 54.00),
                (96, ''Чай зеленый 25 пакетиков'',
                ''Отличается идеально сбалансированным мягким вкусом с тонкими пряными оттенками.'',
                ''773061e8-64c3-4f00-a9bf-3b4b7c86325a'', 76, ''Чай зеленый байховый, мята, ароматизатор.'', 730, TRUE, 109.00, 0),
                (97, ''Кофе растворимый'',
                ''Легко и быстро заваривается, его можно пить черным или с добавлением молока.'',
                ''5a258afb-72b5-4cc3-bc09-2482165bbcd3'', 150, ''Кофе'', 730, TRUE, 499.00, 100.00),
                (98, ''Кофе молотый'',
                ''Великолепная кофейная смесь с богатым и продолжительным послевкусием.'',
                ''93e2a8ea-4004-4154-a6d9-92cae3150d25'', 250, ''Кофе'', 540, TRUE, 299.00, 120.00),
                (99, ''Шейка говядины'',
                ''Полностью отвечает требованиям Халяль.'',
                ''cb6ead5b-8962-46bc-84ad-f6f8b71b2f21'', 400, ''Говядина'', 9, TRUE, 281.00, 22.00),
                (100, ''Гуляш из говядины'',
                ''Кусочки отборного свежего мяса без кости будут хороши в любом виде.'',
                ''242f2340-caf4-414a-a467-848253a58286'', 400, ''Говядина'', 9, FALSE, 284.00, 0),
                (101, ''Корейка из баранины'',
                ''Самое нежное мясо, которое идеально подходит для тушения или запекания.'',
                ''56129265-bb54-4d81-a15c-51f3d0e63bca'', 400, ''Баранина'', 9, TRUE, 749.00, 0),
                (102, ''Ребрышки бараньи'',
                ''Прекрасно подходят для жарки на огне.'',
                ''efc0be2c-bb0c-4b5f-820b-2bf3c5fe7217'', 400, ''Баранина'', 9, TRUE, 282.00, 0),
                (103, ''Карбонад из свинины'',
                ''Полуфабрикат мясной натуральный крупнокусковой бескостный из свинины категории А.'',
                ''56c8fc7c-0877-41f1-8344-a7172ce3eb52'', 1500, ''Свинина'', 21, TRUE, 742.50, 0),
                (104, ''Шейка свиная'',
                ''Крупный кусок свинины без кости, с нежной текстурой и жировыми прослойками.'',
                ''bc4982cc-5aec-4a8f-b3c8-093fbf418a83'', 1400, ''Свинина'', 21, TRUE, 726.60, 0),
                (105, ''Лопатка свиная'',
                ''Благодаря небольшим жировым прослойкам готовое мясо очень нежное и сочное.'',
                ''2c463642-da6a-4568-944f-8e877e3bc808'', 1200, ''Свинина'', 21, TRUE, 392.40, 0),
                (106, ''Филе цыпленка-бройлера без кожи'',
                ''Части тушек цыплят-бройлеров. Продукт охлажден.100% натурально. Без инъекций.'',
                ''3dfbbe2e-dc25-4ef1-a6bc-264eaef74deb'', 1000, ''Курица'', 8, TRUE, 381.00, 19.00),
                (107, ''Голень цыпленка-бройлера'',
                ''Части тушек цыплят-бройлеров. Продукт охлажден.100% натурально. Без инъекций.'',
                ''a5023c36-40fd-42a7-b25c-43c7f4a12e92'', 1000, ''Курица'', 8, TRUE, 304.00, 53.00),
                (108, ''Тушка цыпленка-бройлера'',
                ''Мясо кур, тушки ЦБ потрошеные, не калиброванные.'',
                ''b0b87353-ce6a-4926-8178-774f7d4fbb84'', 2000, ''Курица'', 5, TRUE, 550.00, 0),
                (109, ''Сосиски Венские'',
                ''Изготовлены из говядины и свинины, а перец и мускатный орех придают пикантные нотки.'',
                ''80be37d3-aa92-43c2-87cc-0ffc38471b22'', 330, ''Свинина, говядина, вода, усилитель вкуса, соль.'', 20, TRUE, 233.00, 66.00),
                (110, ''Сосиски Молочные'',
                ''Молоко придает вкусу нежность, а мускатный орех и перец — пикантность.'',
                ''a00ee913-09a6-496f-9dd6-d6ef10454597'', 530, ''Свинина, говядина, вода, молоко сухое, соль.'', 10, FALSE, 348.00, 139.00),
                (111, ''Сосиски Докторские'',
                ''Продукт можно быстро отварить или пожарить на завтрак или ужин.'',
                ''03ecb501-6e52-4da0-8fd9-f0adf6ed4365'', 240, ''Мясо птицы, говядина, вода, специи, краситель.'', 20, TRUE, 167.00, 0),
                (112, ''Сосиски Докторские'',
                ''Продукт можно быстро отварить или пожарить на завтрак или ужин.'',
                ''73966b3f-9e3a-4c02-b034-8c87f0b32459'', 240, ''Мясо птицы, говядина, вода, специи, краситель.'', 20, TRUE, 167.00, 0),
                (113, ''Форель кусок cлабосоленая'',
                ''Соленая пищевая рыбная продукция: форель радужная филе-кусок с кожей слабосоленая.'',
                ''64143396-1c41-4087-a80a-c68df965dec5'', 200, ''Форель, соль, консерванты: Е211, Е202.'', 60, TRUE, 379.00, 35.00),
                (114, ''Сельдь филе'',
                ''Нежная и вкусная, она хороша в салатах и в пару к картофелю.'',
                ''1fc8481f-80a6-410f-885a-5290540cf96f'', 250, ''Филе сельди, масло рапсовое, соль, консерванты.'', 120, TRUE, 151.00, 20.00),
                (115, ''Пангасиус филе замороженный'',
                ''Регион вылова: Вьетнам.'',
                ''00cf340f-99cf-4d4e-b916-024b5e50b423'', 500, ''Пангасиус.'', 270, TRUE, 253.00, 24.00),
                (116, ''Треска филе замороженная'',
                ''Достаточно лишь разморозить рыбу при комнатной температуре и приготовить любым способом.'',
                ''e604d950-987f-4dbc-91cd-b58c2552b0ca'', 1000, ''Треска.'', 180, TRUE, 580.00, 0),
                (117, ''Скумбрия холодного копчения'',
                ''Рыба холодного копчения. Кусочки упакованы под вакуумом.'',
                ''c05e36f9-acc6-4528-ab9e-887fc62bc4f2'', 300, ''Скумбрия б/г, соль пищевая.'', 14, TRUE, 214.00, 0),
                (118, ''Майонез Оливковый'',
                ''Благородный вкус и изысканный аромат с тонким оттенком оливкового масла.'',
                ''35dc3ae0-507f-463e-a217-8acf85a6f89d'', 400, ''Масла, вода, сахар, яйца, соль, уксус.'', 90, TRUE, 109.00, 0),
                (119, ''Майонез на перепелиных яйцах'',
                ''Изысканный вкус, дополненный заботой о здоровье.'',
                ''1cff2b03-18db-413a-bd20-32f6f0152e24'', 200, ''Масла, вода, сахар, переп. яйца, соль, уксус.'', 90, TRUE, 61.90, 0),
                (120, ''Кетчуп Томатный'',
                ''Классический томатный кетчуп идеально дополнит практически любое блюдо.'',
                ''941af6f0-0b7c-4369-8a66-72c8d74b7b81'', 342, ''Вода, паста томатная, сахар, уксус, соль, специи.'', 365, FALSE, 89.90, 0),
                (121, ''Кетчуп Итальянский'',
                ''Незаменим в приготовлении спагетти Бoлоньезе, пиццы и других блюд итальянской кухни.'',
                ''c1594369-b084-46f9-bc1b-38adf9cf86a8'', 350, ''Вода, паста томатная, сахар, уксус, соль, специи.'', 365, TRUE, 85.90, 0);

        ALTER SEQUENCE IF EXISTS products_product_id_seq RESTART WITH 122;

        END IF;
END;
' language plpgsql;

    /*
            PRODUCTS SEARCH
    */
DO ' DECLARE
BEGIN
    IF NOT EXISTS (SELECT 1 FROM products_search WHERE product_search_id=1) THEN
        INSERT INTO products_search
        	SELECT p.product_id, setweight(to_tsvector(''russian'', p.name), ''A'') ||
        						  setweight(to_tsvector(''russian'', p.description), ''B'') ||
        						  setweight(to_tsvector(''russian'', p.composition), ''C'') AS tsv
        	FROM products AS p;
    END IF;
END;
' language plpgsql;

    /*
            PROMOCODES
    */

DO ' DECLARE
BEGIN
    IF NOT EXISTS (SELECT 1 FROM promo_codes WHERE promo_code_id=1) THEN
       INSERT INTO promo_codes
        VALUES  (1, 1, ''2021-11-01 19:10:25'', ''Прекрасный промокод, только на 1 неделю ноября.'',
                    ''НАЧАЛОНОЯБРЯ'', TRUE, ''2021-11-01 19:10:25'', ''2021-11-08 19:10:25'',
                    null, 10, 100.00, null, null, FALSE),
                (2, 1, ''2021-10-25 10:10:25'', ''Всем новым пользователям. Акция ограничена!'',
                ''НОВИЧОК200'', TRUE, null, null,
                60, 55, 200.00, null, null, TRUE),
                (3, 1, ''2021-11-04 12:55:25'', ''Получи 5% скидку на весь ассортимент до конца ноября!'',
                ''НА5МЕНЬШЕ'', TRUE, null, ''2021-11-30 23:59:59'',
                null, 32, null, 5.00, null, FALSE),
                (4, 1, ''2021-11-02 10:40:25'', ''Спец. промокод на 50 рублей для Ершова Ивана Альбертовича!'',
                ''ЕРШОВ50'', TRUE, null, null,
                1, 0, 50, null, 15, FALSE),
                (5, 1, ''2021-11-02 10:40:25'', ''Спец. промокод на 50 рублей для Дементьева Марка Михайловича!'',
                ''ДЕМЕНТЬЕВ50'', TRUE, null, null,
                1, 0, 50, null, 17, FALSE),
                (6, 1, ''2021-11-02 10:40:25'', ''Спец. промокод на 50 рублей для Беляева Давида Пётровича!'',
                ''БЕЛЯЕВ50'', TRUE, null, null,
                1, 0, 50, null, 19, FALSE),
                (7, 1, ''2021-11-02 10:40:25'', ''Спец. промокод на 50 рублей для Меркушева Роберта Феликсовича!'',
                ''МЕРКУШЕВ50'', TRUE, null, null,
                1, 0, 50, null, 21, FALSE),
                (8, 1, ''2021-11-02 10:40:25'', ''Спец. промокод на 50 рублей для Потапова Алана Семеновича!'',
                ''ПОТАПОВ50'', TRUE, null, null,
                1, 0, 50, null, 24, FALSE),
                (9, 1, ''2021-11-02 10:40:25'', ''Спец. промокод на 50 рублей для Сафонова Игнатия Эдуардовича!'',
                ''САФОНОВ50'', TRUE, null, null,
                1, 0, 50, null, 26, FALSE),
                (10, 1, ''2021-11-02 10:40:25'', ''Спец. промокод на 50 рублей для Лазарева Матвея Еремеевича!'',
                ''ЛАЗАРЕВ50'', FALSE, null, null,
                1, 1, 50, null, 28, FALSE),
                (11, 1, ''2021-11-02 10:40:25'', ''Спец. промокод на 50 рублей для Бандурина Карла Семеновича!'',
                ''БАНДУРИН50'', TRUE, null, null,
                1, 0, 50, null, 30, FALSE),
                (12, 1, ''2021-11-02 10:40:25'', ''Спец. промокод на 50 рублей для Шестаковой Снежаны Макаровны!'',
                ''ШЕСТАКОВА50'', TRUE, null, null,
                1, 0, 50, null, 32, FALSE),
                (13, 1, ''2021-11-02 10:40:25'', ''Спец. промокод на 50 рублей для Журавлёвой Эдиты Петровны!'',
                ''ЖУРАВЛЕВА50'', TRUE, null, null,
                1, 0, 50, null, 34, FALSE),
                (14, 1, ''2021-11-02 10:40:25'', ''Спец. промокод на 50 рублей для Самсоновой Инги Ярославовны!'',
                ''САМСОНОВА50'', TRUE, null, null,
                1, 0, 50, null, 39, FALSE),
                (15, 1, ''2021-11-02 10:40:25'', ''Спец. промокод на 50 рублей для Кулаковой Ксении Вадимовны!'',
                ''КУЛАКОВА50'', TRUE, null, null,
                1, 0, 50, null, 44, FALSE),
                (16, 1, ''2021-11-02 10:40:25'', ''Спец. промокод на 50 рублей для Терентьевой Азы Наумовны!'',
                ''ТЕРЕНТЬЕВА50'', FALSE, null, null,
                1, 1, 50, null, 49, FALSE),
                (17, 1, ''2021-11-05 00:00:00'', ''40 ноябрьских счастливчиков получат 50 рублей на первый заказ!'',
                ''СЧАСТЛИВЧИКНОЯ'', TRUE, null, ''2021-11-30 23:59:59'',
                40, 21, 50, null, null, TRUE),
                (18, 1, ''2021-10-01 16:13:00'', ''В честь создания команды проекта 3% на всю продукцию первым 500!'',
                ''НАШАКОМАНДА'', TRUE, null, ''2021-11-30 23:59:59'',
                500, 321, 0, 3.00, null, FALSE),
                (19, 1, ''2021-11-01 16:13:00'', ''Мелочь, а приятно. 1% всем до конца года!'',
                ''МЕЛОЧЬ'', TRUE, ''2021-11-02 00:00:00'', null,
                null, 0, 0, 1.00, null, FALSE),
                (20, 1, ''2021-11-10 18:09:00'', ''Черная пятница! 300 рублей всем, но только 11.11'',
                ''ЧЕРНАЯПЯТНИЦА'', TRUE, ''2021-11-11 00:00:00'', ''2021-11-11 23:59:59'',
                null, 23, 300, null, null, FALSE),
                (21, 1, ''2021-11-07 11:39:32'', ''Большая скидка - 7%, но только первым 10.'',
                ''ПЕРВЫЕ10'', TRUE, ''2021-11-08 00:00:00'', null,
                10, 0, null, 7.0, null, FALSE),
                (22, 1, ''2021-11-01 21:39:32'', ''Декабрьским новчикам везет! По 5% на все покупки! Количество ограничено.'',
                ''НОВИЧОКДЕК'', TRUE, ''2021-12-01 00:00:00'', ''2021-12-31 23:59:59'',
                10, 0, null, 5.0, null, TRUE),
                (23, 1, ''2021-11-07 13:45:21'', ''В середине ноября раздаем по 150 рублей первым 12 покупателям!'',
                ''СЕРЕДИНАНОЯБРЯ'', TRUE, ''2021-11-08 00:00:00'', ''2021-11-15 23:59:59'',
                12, 0, 150.0, null, null, FALSE),
                (24, 1, ''2021-10-28 20:01:51'', ''Нет подходящих промокодов? Встречайте, безлимитный промокод на 10 рублей всегда!'',
                ''ДЕСЯТОЧКА'', TRUE, null, null,
                null, 0, 10.0, null, null, FALSE);

        ALTER SEQUENCE IF EXISTS promo_codes_promo_code_id_seq RESTART WITH 24;

        END IF;
END;
' language plpgsql;

DO ' DECLARE
BEGIN
    IF NOT EXISTS (SELECT 1 FROM chats WHERE chat_id=2) THEN
        INSERT INTO chats
        	VALUES 	(2, 2, ''2021-10-28 10:01:25''),
        			(3, 3, ''2021-10-30 11:32:22''),
        			(4, 4, ''2021-10-25 15:38:51''),
        			(5, 5, ''2021-11-01 13:52:19''),
        			(6, 6, ''2021-11-02 03:00:08''),
        			(7, 7, ''2021-11-02 15:15:42''),
        			(8, 8, ''2021-11-03 19:48:29''),
        			(9, 9, ''2021-11-04 11:17:51''),
        			(10, 10, ''2021-11-05 02:31:55''),
        			(11, 11, ''2021-11-07 21:26:22'');

        ALTER SEQUENCE IF EXISTS chats_chat_id_seq RESTART WITH 11;

        END IF;
END;
' language plpgsql;

DO ' DECLARE
BEGIN
IF NOT EXISTS (SELECT 1 FROM couriers WHERE courier_id = 52) THEN
INSERT INTO couriers(courier_id, warehouse_id, phone_number, address, current_balance)
    VALUES

        (52, 1, ''+7 (977) 777-77-77'', ''Кадашёвская набережная, 30'', 2000),
        (53, 1, ''+7 (977) 777-77-78'', ''Кадашёвская набережная, 30'', 0),
        (54, 1, ''+7 (977) 777-77-79'', ''Кадашёвская набережная, 24'', 320),
        (55, 1, ''+7 (977) 777-77-80'', ''Кадашёвская набережная, 32'', 1242.2),

        (56, 2, ''+7 (977) 777-77-81'', ''Бакинская улица, 4'', 0),
        (57, 2, ''+7 (977) 777-77-82'', ''Бакинская улица, 6'', 4201.23),
        (58, 2, ''+7 (977) 777-77-83'', ''Бакинская улица, 2'', 121.47),
        (59, 2, ''+7 (977) 777-77-84'', ''Бакинская улица, 8'', 0),


        (60, 3, ''+7 (977) 777-77-85'', ''Молодогвардейская улица, 4'', 3821),
        (61, 3, ''+7 (977) 777-77-86'', ''Молодогвардейская улица, 6'', 843.1),
        (62, 3, ''+7 (977) 777-77-87'', ''Молодогвардейская улица, 8'', 451),
        (63, 3, ''+7 (977) 777-77-88'', ''Молодогвардейская улица, 2'', 901.98),


        (64, 4, ''+7 (977) 777-77-89'', ''Отрадный проезд, 10'', 3821),
        (65, 4, ''+7 (977) 777-77-90'', ''Отрадный проезд, 14'', 843.1),
        (66, 4, ''+7 (977) 777-77-91'', ''Отрадный проезд, 12'', 451),
        (67, 4, ''+7 (977) 777-77-92'', ''Отрадный проезд, 9'', 901.98),

        (68, 5, ''+7 (977) 777-77-93'', ''Братская улица, 19к1'', 141.32),
        (69, 5, ''+7 (977) 777-77-94'', ''Братская улица, 19к2'', 890),
        (70, 5, ''+7 (977) 777-77-95'', ''Братская улица, 19к3'', 5345.9),
        (71, 5, ''+7 (977) 777-77-96'', ''Братская улица, 15к1'', 735);

END IF;
END;
' language plpgsql;

DO ' DECLARE
BEGIN
IF NOT EXISTS (SELECT 1 FROM product_positions WHERE product_position_id = 1) THEN
INSERT INTO product_positions(product_id, warehouse_id, warehouse_section, supply_amount, current_amount, supply_date, supplier_invoice, supplier_name, is_invoice_paid, manufacture_date)
    VALUES
        (1, 1, ''Ц-1-100-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8435, ''ЭкоНива'', false, date (CURRENT_DATE) - integer ''3''),  -- 120.5 * 0.7 = 84,35р
        (1, 2, ''Ю-1-100-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8435, ''ЭкоНива'', true, date (CURRENT_DATE) - integer ''3''),
        (1, 3, ''З-1-100-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8435, ''ЭкоНива'', true, date (CURRENT_DATE) - integer ''3''),
        (1, 4, ''С-1-100-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8435, ''ЭкоНива'', true, date (CURRENT_DATE) - integer ''3''),
        (1, 5, ''В-1-100-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8435, ''ЭкоНива'', true, date (CURRENT_DATE) - integer ''3''),

        (2, 1, ''Ц-1-101-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 5040, ''ЭкоНива'', false, date (CURRENT_DATE) - integer ''3''),   -- 80 * 0.7 = 56р
        (2, 2, ''Ю-1-101-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 5040, ''ЭкоНива'', true, date (CURRENT_DATE) - integer ''3''),
        (2, 3, ''З-1-101-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 5040, ''ЭкоНива'', true, date (CURRENT_DATE) - integer ''3''),
        (2, 4, ''С-1-101-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 5040, ''ЭкоНива'', true, date (CURRENT_DATE) - integer ''3''),
        (2, 5, ''В-1-101-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 5040, ''ЭкоНива'', true, date (CURRENT_DATE) - integer ''3''),

        (3, 1, ''Ц-1-102-Л'', 80, 40, date (CURRENT_DATE) - integer ''3'', 6160, ''Nemoloko'', true, date (CURRENT_DATE) - integer ''3''),  -- 110 * 0.7 = 77
        (3, 2, ''Ю-1-102-Л'', 80, 40, date (CURRENT_DATE) - integer ''3'', 6160, ''Nemoloko'', true, date (CURRENT_DATE) - integer ''3''),
        (3, 3, ''З-1-102-Л'', 80, 40, date (CURRENT_DATE) - integer ''3'', 6160, ''Nemoloko'', true, date (CURRENT_DATE) - integer ''3''),
        (3, 4, ''С-1-102-Л'', 80, 40, date (CURRENT_DATE) - integer ''3'', 6160, ''Nemoloko'', true, date (CURRENT_DATE) - integer ''3''),
        (3, 5, ''В-1-102-Л'', 80, 40, date (CURRENT_DATE) - integer ''3'', 6160, ''Nemoloko'', true, date (CURRENT_DATE) - integer ''3''),

        (4, 1, ''Ц-1-103-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10185, ''ЭкоНива'', true, date (CURRENT_DATE) - integer ''3''), -- 145.5 * 0.7 = 101.85
        (4, 2, ''Ю-1-103-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10185, ''ЭкоНива'', true, date (CURRENT_DATE) - integer ''3''),
        (4, 3, ''З-1-103-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10185, ''ЭкоНива'', true, date (CURRENT_DATE) - integer ''3''),
        (4, 4, ''С-1-103-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10185, ''ЭкоНива'', true, date (CURRENT_DATE) - integer ''3''),
        (4, 5, ''В-1-103-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10185, ''ЭкоНива'', true, date (CURRENT_DATE) - integer ''3''),

        (5, 1, ''Ц-1-104-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 8694, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''), -- 138 * 0.7 = 96.6
        (5, 2, ''Ю-1-104-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 8694, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),
        (5, 3, ''З-1-104-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 8694, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),
        (5, 4, ''С-1-104-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 8694, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),
        (5, 5, ''В-1-104-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 8694, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),

        (6, 1, ''Ц-1-105-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5850, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),    -- 83.9 * 0.7 = 58.5
        (6, 2, ''Ю-1-105-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5850, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),
        (6, 3, ''З-1-105-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5850, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),
        (6, 4, ''С-1-105-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5850, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),
        (6, 5, ''В-1-105-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5850, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),

        (7, 1, ''Ц-1-106-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 2385, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''), -- 37.9 * 0.7 = 26.5
        (7, 2, ''Ю-1-106-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 2385, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),
        (7, 3, ''З-1-106-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 2385, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),
        (7, 4, ''С-1-106-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 2385, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),
        (7, 5, ''В-1-106-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 2385, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),

        (8, 1, ''Ц-1-107-Л'', 80, 40, date (CURRENT_DATE) - integer ''3'', 3040, ''Сарафаново'', true, date (CURRENT_DATE) - integer ''3''),    -- 54.9 * 0.7 = 38
        (8, 2, ''Ю-1-107-Л'', 80, 40, date (CURRENT_DATE) - integer ''3'', 3040, ''Сарафаново'', true, date (CURRENT_DATE) - integer ''3''),
        (8, 3, ''З-1-107-Л'', 80, 40, date (CURRENT_DATE) - integer ''3'', 3040, ''Сарафаново'', true, date (CURRENT_DATE) - integer ''3''),
        (8, 4, ''С-1-107-Л'', 80, 40, date (CURRENT_DATE) - integer ''3'', 3040, ''Сарафаново'', true, date (CURRENT_DATE) - integer ''3''),
        (8, 5, ''В-1-107-Л'', 80, 40, date (CURRENT_DATE) - integer ''3'', 3040, ''Сарафаново'', true, date (CURRENT_DATE) - integer ''3''),


        (9, 1, ''Ц-1-108-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4900, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),    --  69.9* 0.7 = 49
        (9, 2, ''Ю-1-108-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4900, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),
        (9, 3, ''З-1-108-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4900, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),
        (9, 4, ''С-1-108-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4900, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),
        (9, 5, ''В-1-108-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4900, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),


        (10, 1, ''Ц-1-109-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 6300, ''Сарафаново'', true, date (CURRENT_DATE) - integer ''3''),   --  99.9* 0.7 =  70
        (10, 2, ''Ю-1-109-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 6300, ''Сарафаново'', true, date (CURRENT_DATE) - integer ''3''),
        (10, 3, ''З-1-109-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 6300, ''Сарафаново'', true, date (CURRENT_DATE) - integer ''3''),
        (10, 4, ''С-1-109-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 6300, ''Сарафаново'', true, date (CURRENT_DATE) - integer ''3''),
        (10, 5, ''В-1-109-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 6300, ''Сарафаново'', true, date (CURRENT_DATE) - integer ''3''),

        (11, 1, ''Ц-1-110-Л'', 80, 40, date (CURRENT_DATE) - integer ''3'', 4640, ''Милава'', true, date (CURRENT_DATE) - integer ''3''),   --  82.9* 0.7 = 58
        (11, 2, ''Ю-1-110-Л'', 80, 40, date (CURRENT_DATE) - integer ''3'', 4640, ''Милава'', true, date (CURRENT_DATE) - integer ''3''),
        (11, 3, ''З-1-110-Л'', 80, 40, date (CURRENT_DATE) - integer ''3'', 4640, ''Милава'', true, date (CURRENT_DATE) - integer ''3''),
        (11, 4, ''С-1-110-Л'', 80, 40, date (CURRENT_DATE) - integer ''3'', 4640, ''Милава'', true, date (CURRENT_DATE) - integer ''3''),
        (11, 5, ''В-1-110-Л'', 80, 40, date (CURRENT_DATE) - integer ''3'', 4640, ''Милава'', true, date (CURRENT_DATE) - integer ''3''),

        (12, 1, ''Ц-1-111-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4900, ''Милава'', true, date (CURRENT_DATE) - integer ''3''),  --  70.2* 0.7 =49
        (12, 2, ''Ю-1-111-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4900, ''Милава'', true, date (CURRENT_DATE) - integer ''3''),
        (12, 3, ''З-1-111-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4900, ''Милава'', true, date (CURRENT_DATE) - integer ''3''),
        (12, 4, ''С-1-111-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4900, ''Милава'', true, date (CURRENT_DATE) - integer ''3''),
        (12, 5, ''В-1-111-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4900, ''Милава'', true, date (CURRENT_DATE) - integer ''3''),

        (13, 1, ''Ц-1-112-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 1785, ''Чудское озеро'', true, date (CURRENT_DATE) - integer ''3''),   --  25.5* 0.7 = 17.85
        (13, 2, ''Ю-1-112-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 1785, ''Чудское озеро'', true, date (CURRENT_DATE) - integer ''3''),
        (13, 3, ''З-1-112-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 1785, ''Чудское озеро'', true, date (CURRENT_DATE) - integer ''3''),
        (13, 4, ''С-1-112-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 1785, ''Чудское озеро'', true, date (CURRENT_DATE) - integer ''3''),
        (13, 5, ''В-1-112-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 1785, ''Чудское озеро'', true, date (CURRENT_DATE) - integer ''3''),

        (14, 1, ''Ц-1-113-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5800,''Чудское озеро'', true, date (CURRENT_DATE) - integer ''3''),    --  83.9* 0.7 = 58
        (14, 2, ''Ю-1-113-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 5220, ''Чудское озеро'', true, date (CURRENT_DATE) - integer ''3''),
        (14, 3, ''З-1-113-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5800,''Чудское озеро'', true, date (CURRENT_DATE) - integer ''3''),
        (14, 4, ''С-1-113-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 5220,''Чудское озеро'', true, date (CURRENT_DATE) - integer ''3''),
        (14, 5, ''В-1-113-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5800,''Чудское озеро'', true, date (CURRENT_DATE) - integer ''3''),

        (15, 1, ''Ц-1-114-Л'', 90, 45, date (CURRENT_DATE) - integer ''3'', 11880, ''Брест-Литовск'', true, date (CURRENT_DATE) - integer ''3''),   --  189* 0.7 =132
        (15, 2, ''Ю-1-114-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13200, ''Брест-Литовск'', true, date (CURRENT_DATE) - integer ''3''),
        (15, 3, ''З-1-114-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13200, ''Брест-Литовск'', true, date (CURRENT_DATE) - integer ''3''),
        (15, 4, ''С-1-114-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13200, ''Брест-Литовск'', true, date (CURRENT_DATE) - integer ''3''),
        (15, 5, ''В-1-114-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13200, ''Брест-Литовск'', true, date (CURRENT_DATE) - integer ''3''),

        (16, 1, ''Ц-1-115-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13600, ''Брест-Литовск'', true, date (CURRENT_DATE) - integer ''3''),  --  194* 0.7 =136
        (16, 2, ''Ю-1-115-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13600, ''Брест-Литовск'', true, date (CURRENT_DATE) - integer ''3''),
        (16, 3, ''З-1-115-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13600, ''Брест-Литовск'', true, date (CURRENT_DATE) - integer ''3''),
        (16, 4, ''С-1-115-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13600, ''Брест-Литовск'', true, date (CURRENT_DATE) - integer ''3''),
        (16, 5, ''В-1-115-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13600, ''Брест-Литовск'', true, date (CURRENT_DATE) - integer ''3''),

        (17, 1, ''Ц-1-116-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13300, ''Экомилк'', true, date (CURRENT_DATE) - integer ''3''),    --  190* 0.7 = 133
        (17, 2, ''Ю-1-116-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13300, ''Экомилк'', true, date (CURRENT_DATE) - integer ''3''),
        (17, 3, ''З-1-116-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13300, ''Экомилк'', true, date (CURRENT_DATE) - integer ''3''),
        (17, 4, ''С-1-116-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13300, ''Экомилк'', true, date (CURRENT_DATE) - integer ''3''),
        (17, 5, ''В-1-116-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13300, ''Экомилк'', true, date (CURRENT_DATE) - integer ''3''),

        (18, 1, ''Ц-1-117-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 14200, ''Экомилк'', true, date (CURRENT_DATE) - integer ''3''),    -- 203 * 0.7 = 142
        (18, 2, ''Ю-1-117-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 14200, ''Экомилк'', true, date (CURRENT_DATE) - integer ''3''),
        (18, 3, ''З-1-117-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 14200, ''Экомилк'', true, date (CURRENT_DATE) - integer ''3''),
        (18, 4, ''С-1-117-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 14200, ''Экомилк'', true, date (CURRENT_DATE) - integer ''3''),
        (18, 5, ''В-1-117-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 14200, ''Экомилк'', true, date (CURRENT_DATE) - integer ''3''),

        (19, 1, ''Ц-1-118-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 1950, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),    --  27.9* 0.7 =19.5
        (19, 2, ''Ю-1-118-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 1950, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),
        (19, 3, ''З-1-118-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 1950, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),
        (19, 4, ''С-1-118-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 1950, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),
        (19, 5, ''В-1-118-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 1950, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),

        (20, 1, ''Ц-1-119-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2100, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),    --  29.9* 0.7 = 21
        (20, 2, ''Ю-1-119-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2100, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),
        (20, 3, ''З-1-119-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2100, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),
        (20, 4, ''С-1-119-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2100, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),
        (20, 5, ''В-1-119-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2100, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),

        (21, 1, ''Ц-1-120-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2890, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),    --  41.3* 0.7 = 28.9
        (21, 2, ''Ю-1-120-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2890, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),
        (21, 3, ''З-1-120-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2890, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),
        (21, 4, ''С-1-120-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2890, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),
        (21, 5, ''В-1-120-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2890, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),

        (22, 1, ''Ц-1-121-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2890, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),    --  41.3 * 0.7 =28.9
        (22, 2, ''Ю-1-121-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2890, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),
        (22, 3, ''З-1-121-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2890, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),
        (22, 4, ''С-1-121-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2890, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),
        (22, 5, ''В-1-121-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2890, ''Чудо'', true, date (CURRENT_DATE) - integer ''3''),

        (23, 1, ''Ц-1-122-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10700, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),  --  152.9* 0.7 =107
        (23, 2, ''Ю-1-122-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10700, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),
        (23, 3, ''З-1-122-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10700, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),
        (23, 4, ''С-1-122-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10700, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),
        (23, 5, ''В-1-122-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10700, ''Простоквашино'', true, date (CURRENT_DATE) - integer ''3''),

        (24, 1, ''Ц-1-123-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6100, ''Биобаланс'', true, date (CURRENT_DATE) - integer ''3''),   --  87.5* 0.7 = 61
        (24, 2, ''Ю-1-123-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6100, ''Биобаланс'', true, date (CURRENT_DATE) - integer ''3''),
        (24, 3, ''З-1-123-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6100, ''Биобаланс'', true, date (CURRENT_DATE) - integer ''3''),
        (24, 4, ''С-1-123-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6100, ''Биобаланс'', true, date (CURRENT_DATE) - integer ''3''),
        (24, 5, ''В-1-123-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6100, ''Биобаланс'', true, date (CURRENT_DATE) - integer ''3''),


        (25, 1, ''Ц-1-124-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6100, ''Биобаланс'', true, date (CURRENT_DATE) - integer ''3''),   --  87.5* 0.7 = 61
        (25, 2, ''Ю-1-124-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6100, ''Биобаланс'', true, date (CURRENT_DATE) - integer ''3''),
        (25, 3, ''З-1-124-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6100, ''Биобаланс'', true, date (CURRENT_DATE) - integer ''3''),
        (25, 4, ''С-1-124-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6100, ''Биобаланс'', true, date (CURRENT_DATE) - integer ''3''),
        (25, 5, ''В-1-124-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6100, ''Биобаланс'', true, date (CURRENT_DATE) - integer ''3''),


        (26, 1, ''Ц-1-125-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6100, ''Биобаланс'', true, date (CURRENT_DATE) - integer ''3''),   --  87.5* 0.7 = 61
        (26, 2, ''Ю-1-125-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6100, ''Биобаланс'', true, date (CURRENT_DATE) - integer ''3''),
        (26, 3, ''З-1-125-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6100, ''Биобаланс'', true, date (CURRENT_DATE) - integer ''3''),
        (26, 4, ''С-1-125-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6100, ''Биобаланс'', true, date (CURRENT_DATE) - integer ''3''),
        (26, 5, ''В-1-125-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6100, ''Биобаланс'', true, date (CURRENT_DATE) - integer ''3''),


        (27, 1, ''Ц-1-126-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2780, ''Покровский хлеб'', true, date (CURRENT_DATE) - integer ''3''), --  39.70* 0.7 =27.8
        (27, 2, ''Ю-1-126-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2780, ''Покровский хлеб'', true, date (CURRENT_DATE) - integer ''3''),
        (27, 3, ''З-1-126-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2780, ''Покровский хлеб'', true, date (CURRENT_DATE) - integer ''3''),
        (27, 4, ''С-1-126-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2780, ''Покровский хлеб'', true, date (CURRENT_DATE) - integer ''3''),
        (27, 5, ''В-1-126-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2780, ''Покровский хлеб'', true, date (CURRENT_DATE) - integer ''3''),


        (28, 1, ''Ц-1-127-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2650, ''Хлебный дом'', true, date (CURRENT_DATE) - integer ''3''), --  37.9* 0.7 =  26.5
        (28, 2, ''Ю-1-127-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2650, ''Хлебный дом'', true, date (CURRENT_DATE) - integer ''3''),
        (28, 3, ''З-1-127-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2650, ''Хлебный дом'', true, date (CURRENT_DATE) - integer ''3''),
        (28, 4, ''С-1-127-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2650, ''Хлебный дом'', true, date (CURRENT_DATE) - integer ''3''),
        (28, 5, ''В-1-127-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2650, ''Хлебный дом'', true, date (CURRENT_DATE) - integer ''3''),


        (29, 1, ''Ц-1-128-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3633, ''Рижский хлеб'', true, date (CURRENT_DATE) - integer ''3''),    --  51.9* 0.7 = 36.33
        (29, 2, ''Ю-1-128-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3633, ''Рижский хлеб'', true, date (CURRENT_DATE) - integer ''3''),
        (29, 3, ''З-1-128-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3633, ''Рижский хлеб'', true, date (CURRENT_DATE) - integer ''3''),
        (29, 4, ''С-1-128-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3633, ''Рижский хлеб'', true, date (CURRENT_DATE) - integer ''3''),
        (29, 5, ''В-1-128-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3633, ''Рижский хлеб'', true, date (CURRENT_DATE) - integer ''3''),


        (30, 1, ''Ц-1-129-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6780, ''Зелёная миля'', true, date (CURRENT_DATE) - integer ''3''),    --  96.9* 0.7 = 67.8
        (30, 2, ''Ю-1-129-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6780, ''Зелёная миля'', true, date (CURRENT_DATE) - integer ''3''),
        (30, 3, ''З-1-129-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6780, ''Зелёная миля'', true, date (CURRENT_DATE) - integer ''3''),
        (30, 4, ''С-1-129-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6780, ''Зелёная миля'', true, date (CURRENT_DATE) - integer ''3''),
        (30, 5, ''В-1-129-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6780, ''Зелёная миля'', true, date (CURRENT_DATE) - integer ''3''),

        (31, 1, ''Ц-1-130-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6080, ''Зелёная миля'', true, date (CURRENT_DATE) - integer ''3''),    --  86.9* 0.7 = 60.8
        (31, 2, ''Ю-1-130-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6080, ''Зелёная миля'', true, date (CURRENT_DATE) - integer ''3''),
        (31, 3, ''З-1-130-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6080, ''Зелёная миля'', true, date (CURRENT_DATE) - integer ''3''),
        (31, 4, ''С-1-130-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6080, ''Зелёная миля'', true, date (CURRENT_DATE) - integer ''3''),
        (31, 5, ''В-1-130-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6080, ''Зелёная миля'', true, date (CURRENT_DATE) - integer ''3''),

        (32, 1, ''Ц-1-131-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4390, ''Русский сахар'', true, date (CURRENT_DATE) - integer ''3''),   --  62.8* 0.7 = 43.9
        (32, 2, ''Ю-1-131-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4390, ''Русский сахар'', true, date (CURRENT_DATE) - integer ''3''),
        (32, 3, ''З-1-131-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4390, ''Русский сахар'', true, date (CURRENT_DATE) - integer ''3''),
        (32, 4, ''С-1-131-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4390, ''Русский сахар'', true, date (CURRENT_DATE) - integer ''3''),
        (32, 5, ''В-1-131-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4390, ''Русский сахар'', true, date (CURRENT_DATE) - integer ''3''),

        (33, 1, ''Ц-1-132-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 17700, ''Integrita'', true, date (CURRENT_DATE) - integer ''3''),  --  254.0* 0.7 = 177
        (33, 2, ''Ю-1-132-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 17700, ''Integrita'', true, date (CURRENT_DATE) - integer ''3''),
        (33, 3, ''З-1-132-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 17700, ''Integrita'', true, date (CURRENT_DATE) - integer ''3''),
        (33, 4, ''С-1-132-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 17700, ''Integrita'', true, date (CURRENT_DATE) - integer ''3''),
        (33, 5, ''В-1-132-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 17700, ''Integrita'', true, date (CURRENT_DATE) - integer ''3''),

        (34, 1, ''Ц-1-133-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3140, ''Arkhyz'', true, date (CURRENT_DATE) - integer ''3''),  --  44.9* 0.7 = 31.40
        (34, 2, ''Ю-1-133-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3140, ''Arkhyz'', true, date (CURRENT_DATE) - integer ''3''),
        (34, 3, ''З-1-133-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3140, ''Arkhyz'', true, date (CURRENT_DATE) - integer ''3''),
        (34, 4, ''С-1-133-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3140, ''Arkhyz'', true, date (CURRENT_DATE) - integer ''3''),
        (34, 5, ''В-1-133-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3140, ''Arkhyz'', true, date (CURRENT_DATE) - integer ''3''),

        (35, 1, ''Ц-1-134-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4809, ''Arkhyz'', true, date (CURRENT_DATE) - integer ''3''),  --  68.7* 0.7 = 48.09
        (35, 2, ''Ю-1-134-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4809, ''Arkhyz'', true, date (CURRENT_DATE) - integer ''3''),
        (35, 3, ''З-1-134-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4809, ''Arkhyz'', true, date (CURRENT_DATE) - integer ''3''),
        (35, 4, ''С-1-134-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4809, ''Arkhyz'', true, date (CURRENT_DATE) - integer ''3''),
        (35, 5, ''В-1-134-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4809, ''Arkhyz'', true, date (CURRENT_DATE) - integer ''3''),

        (36, 1, ''Ц-1-135-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9600, ''ИП Иванов И.И.'', true, date (CURRENT_DATE) - integer ''3''),  --  137.25* 0.7 = 96
        (36, 2, ''Ю-1-135-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9600, ''ИП Иванов И.И.'', true, date (CURRENT_DATE) - integer ''3''),
        (36, 3, ''З-1-135-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9600, ''ИП Иванов И.И.'', true, date (CURRENT_DATE) - integer ''3''),
        (36, 4, ''С-1-135-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9600, ''ИП Иванов И.И.'', true, date (CURRENT_DATE) - integer ''3''),
        (36, 5, ''В-1-135-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9600, ''ИП Иванов И.И.'', true, date (CURRENT_DATE) - integer ''3''),

        (37, 1, ''Ц-1-136-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18800, ''ИП Иванов И.И.'', true, date (CURRENT_DATE) - integer ''3''), --  269.9* 0.7 = 188
        (37, 2, ''Ю-1-136-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18800, ''ИП Иванов И.И.'', true, date (CURRENT_DATE) - integer ''3''),
        (37, 3, ''З-1-136-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18800, ''ИП Иванов И.И.'', true, date (CURRENT_DATE) - integer ''3''),
        (37, 4, ''С-1-136-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18800, ''ИП Иванов И.И.'', true, date (CURRENT_DATE) - integer ''3''),
        (37, 5, ''В-1-136-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18800, ''ИП Иванов И.И.'', true, date (CURRENT_DATE) - integer ''3''),

        (38, 1, ''Ц-1-137-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6550, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''), --  93.8* 0.7 = 65.5
        (38, 2, ''Ю-1-137-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6550, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),
        (38, 3, ''З-1-137-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6550, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),
        (38, 4, ''С-1-137-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6550, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),
        (38, 5, ''В-1-137-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6550, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),

        (39, 1, ''Ц-1-138-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10493, ''Дядя Ваня'', true, date (CURRENT_DATE) - integer ''3''),  --  149.9* 0.7 = 104.93
        (39, 2, ''Ю-1-138-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10493, ''Дядя Ваня'', true, date (CURRENT_DATE) - integer ''3''),
        (39, 3, ''З-1-138-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10493, ''Дядя Ваня'', true, date (CURRENT_DATE) - integer ''3''),
        (39, 4, ''С-1-138-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10493, ''Дядя Ваня'', true, date (CURRENT_DATE) - integer ''3''),
        (39, 5, ''В-1-138-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10493, ''Дядя Ваня'', true, date (CURRENT_DATE) - integer ''3''),

        (40, 1, ''Ц-1-139-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9090, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),  --  129.9* 0.7 = 90.9
        (40, 2, ''Ю-1-139-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9090, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),
        (40, 3, ''З-1-139-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9090, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),
        (40, 4, ''С-1-139-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9090, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),
        (40, 5, ''В-1-139-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9090, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),

        (41, 1, ''Ц-1-140-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7690, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),  --  109.9* 0.7 = 76.9
        (41, 2, ''Ю-1-140-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7690, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),
        (41, 3, ''З-1-140-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7690, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),
        (41, 4, ''С-1-140-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7690, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),
        (41, 5, ''В-1-140-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7690, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),

        (42, 1, ''Ц-1-141-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 12590, ''Моё лето'', true, date (CURRENT_DATE) - integer ''3''),   --  179.9* 0.7 = 125.9
        (42, 2, ''Ю-1-141-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 12590, ''Моё лето'', true, date (CURRENT_DATE) - integer ''3''),
        (42, 3, ''З-1-141-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 12590, ''Моё лето'', true, date (CURRENT_DATE) - integer ''3''),
        (42, 4, ''С-1-141-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 12590, ''Моё лето'', true, date (CURRENT_DATE) - integer ''3''),
        (42, 5, ''В-1-141-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 12590, ''Моё лето'', true, date (CURRENT_DATE) - integer ''3''),

        (43, 1, ''Ц-1-142-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9090, ''Моё лето'', true, date (CURRENT_DATE) - integer ''3''),    --  129.9* 0.7 = 90.9
        (43, 2, ''Ю-1-142-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9090, ''Моё лето'', true, date (CURRENT_DATE) - integer ''3''),
        (43, 3, ''З-1-142-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9090, ''Моё лето'', true, date (CURRENT_DATE) - integer ''3''),
        (43, 4, ''С-1-142-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9090, ''Моё лето'', true, date (CURRENT_DATE) - integer ''3''),
        (43, 5, ''В-1-142-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9090, ''Моё лето'', true, date (CURRENT_DATE) - integer ''3''),

        (44, 1, ''Ц-1-143-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18890, ''Моё лето'', true, date (CURRENT_DATE) - integer ''3''),   --  269.9* 0.7 = 188.9
        (44, 2, ''Ю-1-143-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18890, ''Моё лето'', true, date (CURRENT_DATE) - integer ''3''),
        (44, 3, ''З-1-143-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18890, ''Моё лето'', true, date (CURRENT_DATE) - integer ''3''),
        (44, 4, ''С-1-143-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18890, ''Моё лето'', true, date (CURRENT_DATE) - integer ''3''),
        (44, 5, ''В-1-143-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18890, ''Моё лето'', true, date (CURRENT_DATE) - integer ''3''),

        (45, 1, ''Ц-1-144-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2160, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),  --  30.9* 0.7 = 21.6
        (45, 2, ''Ю-1-144-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2160, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),
        (45, 3, ''З-1-144-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2160, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),
        (45, 4, ''С-1-144-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2160, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),
        (45, 5, ''В-1-144-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2160, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),

        (46, 1, ''Ц-1-145-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5990, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),  --  50 -> 59.9
        (46, 2, ''Ю-1-145-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5990, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),
        (46, 3, ''З-1-145-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5990, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),
        (46, 4, ''С-1-145-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5990, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),
        (46, 5, ''В-1-145-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5990, ''ИП Петров П.П.'', true, date (CURRENT_DATE) - integer ''3''),

        (47, 1, ''Ц-1-146-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3900, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''), --  55.9 * 0.7 = 39
        (47, 2, ''Ю-1-146-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3900, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),
        (47, 3, ''З-1-146-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3900, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),
        (47, 4, ''С-1-146-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3900, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),
        (47, 5, ''В-1-146-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3900, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),

        (48, 1, ''Ц-1-147-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3550, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''), --  50.85* 0.7 = 35.5
        (48, 2, ''Ю-1-147-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3550, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),
        (48, 3, ''З-1-147-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3550, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),
        (48, 4, ''С-1-147-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3550, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),
        (48, 5, ''В-1-147-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3550, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),

        (49, 1, ''Ц-1-148-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6990, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''), --  99.9* 0.7 = 69.9
        (49, 2, ''Ю-1-148-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6990, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),
        (49, 3, ''З-1-148-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6990, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),
        (49, 4, ''С-1-148-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6990, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),
        (49, 5, ''В-1-148-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6990, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),

        (50, 1, ''Ц-1-149-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2440, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''), --  34.9* 0.7 = 24.4
        (50, 2, ''Ю-1-149-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2440, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),
        (50, 3, ''З-1-149-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2440, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),
        (50, 4, ''С-1-149-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2440, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),
        (50, 5, ''В-1-149-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 2440, ''ИП Фёдоров Ф.Ф.'', true, date (CURRENT_DATE) - integer ''3''),

        (51, 1, ''Ц-1-150-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8390, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),    --  119.90 * 0/7 = 83.9
        (51, 2, ''Ю-1-150-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8390, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (51, 3, ''З-1-150-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8390, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (51, 4, ''С-1-150-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8390, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (51, 5, ''В-1-150-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8390, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),


        (52, 1, ''Ц-1-151-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5590, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),    --  79.9* 0.7 = 55.9
        (52, 2, ''Ю-1-151-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5590, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (52, 3, ''З-1-151-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5590, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (52, 4, ''С-1-151-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5590, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (52, 5, ''В-1-151-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5590, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),


        (53, 1, ''Ц-1-152-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18470, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),   --  263.9* 0.7 = 184.7
        (53, 2, ''Ю-1-152-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18470, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (53, 3, ''З-1-152-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18470, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (53, 4, ''С-1-152-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18470, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (53, 5, ''В-1-152-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18470, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),


        (54, 1, ''Ц-1-153-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3490, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),    --  49.9* 0.7 = 34.9
        (54, 2, ''Ю-1-153-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3490, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (54, 3, ''З-1-153-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3490, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (54, 4, ''С-1-153-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3490, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (54, 5, ''В-1-153-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 3490, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),



        (55, 1, ''Ц-1-154-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13390, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),   --  199.9* 0.7 = 133.9
        (55, 2, ''Ю-1-154-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13390, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (55, 3, ''З-1-154-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13390, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (55, 4, ''С-1-154-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13390, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (55, 5, ''В-1-154-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13390, ''ИП Алексеев А.А.'', true, date (CURRENT_DATE) - integer ''3''),



        (56, 1, ''Ц-1-155-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11893, ''ИП Михайлов М.М.'', true, date (CURRENT_DATE) - integer ''3''),   --  169.9* 0.7 = 118.93
        (56, 2, ''Ю-1-155-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11893, ''ИП Михайлов М.М.'', true, date (CURRENT_DATE) - integer ''3''),
        (56, 3, ''З-1-155-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11893, ''ИП Михайлов М.М.'', true, date (CURRENT_DATE) - integer ''3''),
        (56, 4, ''С-1-155-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11893, ''ИП Михайлов М.М.'', true, date (CURRENT_DATE) - integer ''3''),
        (56, 5, ''В-1-155-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11893, ''ИП Михайлов М.М.'', true, date (CURRENT_DATE) - integer ''3''),



        (57, 1, ''Ц-1-156-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11893, ''ИП Михайлов М.М.'', true, date (CURRENT_DATE) - integer ''3''),   --  169.9* 0.7 = 118.93
        (57, 2, ''Ю-1-156-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11893, ''ИП Михайлов М.М.'', true, date (CURRENT_DATE) - integer ''3''),
        (57, 3, ''З-1-156-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11893, ''ИП Михайлов М.М.'', true, date (CURRENT_DATE) - integer ''3''),
        (57, 4, ''С-1-156-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11893, ''ИП Михайлов М.М.'', true, date (CURRENT_DATE) - integer ''3''),
        (57, 5, ''В-1-156-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11893, ''ИП Михайлов М.М.'', true, date (CURRENT_DATE) - integer ''3''),


        (58, 1, ''Ц-1-157-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13990, ''ИП Михайлов М.М.'', true, date (CURRENT_DATE) - integer ''3''),   --  199.9 * 0.7=139.9
        (58, 2, ''Ю-1-157-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13990, ''ИП Михайлов М.М.'', true, date (CURRENT_DATE) - integer ''3''),
        (58, 3, ''З-1-157-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13990, ''ИП Михайлов М.М.'', true, date (CURRENT_DATE) - integer ''3''),
        (58, 4, ''С-1-157-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13990, ''ИП Михайлов М.М.'', true, date (CURRENT_DATE) - integer ''3''),
        (58, 5, ''В-1-157-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13990, ''ИП Михайлов М.М.'', true, date (CURRENT_DATE) - integer ''3''),


        (59, 1, ''Ц-1-158-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 12950, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),    --  185* 0.7 = 129.5
        (59, 2, ''Ю-1-158-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 12950, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (59, 3, ''З-1-158-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 12950, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (59, 4, ''С-1-158-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 12950, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (59, 5, ''В-1-158-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 12950, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),


        (60, 1, ''Ц-1-159-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 12250, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),    --  175 * 0.7 = 122.5
        (60, 2, ''Ю-1-159-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 12250, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (60, 3, ''З-1-159-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 12250, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (60, 4, ''С-1-159-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 12250, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (60, 5, ''В-1-159-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 12250, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),

        (61, 1, ''Ц-1-160-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9090, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''), --  129.9* 0.7 = 90.90
        (61, 2, ''Ю-1-160-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9090, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (61, 3, ''З-1-160-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9090, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (61, 4, ''С-1-160-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9090, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (61, 5, ''В-1-160-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9090, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),

        (62, 1, ''Ц-1-161-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6900, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''), --  60 -> 69
        (62, 2, ''Ю-1-161-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6900, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (62, 3, ''З-1-161-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6900, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (62, 4, ''С-1-161-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6900, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (62, 5, ''В-1-161-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6900, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),

        (63, 1, ''Ц-1-162-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5940, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''), --  84.9* 0.7 =59.4
        (63, 2, ''Ю-1-162-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5940, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (63, 3, ''З-1-162-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5940, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (63, 4, ''С-1-162-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5940, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (63, 5, ''В-1-162-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5940, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),

        (64, 1, ''Ц-1-163-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8390, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''), --  119.9* 0.7 =83.9
        (64, 2, ''Ю-1-163-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8390, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (64, 3, ''З-1-163-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8390, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (64, 4, ''С-1-163-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8390, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (64, 5, ''В-1-163-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8390, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),

        (65, 1, ''Ц-1-164-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6990, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''), --  99.9* 0.7 =69.9
        (65, 2, ''Ю-1-164-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6990, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (65, 3, ''З-1-164-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6990, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (65, 4, ''С-1-164-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6990, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),
        (65, 5, ''В-1-164-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6990, ''ИП Александров А.А.'', true, date (CURRENT_DATE) - integer ''3''),

        (66, 1, ''Ц-1-165-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5459, ''Chiquita'', true, date (CURRENT_DATE) - integer ''3''),    --  77.99* 0.7 =54.59
        (66, 2, ''Ю-1-165-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5459, ''Chiquita'', true, date (CURRENT_DATE) - integer ''3''),
        (66, 3, ''З-1-165-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5459, ''Chiquita'', true, date (CURRENT_DATE) - integer ''3''),
        (66, 4, ''С-1-165-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5459, ''Chiquita'', true, date (CURRENT_DATE) - integer ''3''),
        (66, 5, ''В-1-165-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5459, ''Chiquita'', true, date (CURRENT_DATE) - integer ''3''),

        (67, 1, ''Ц-1-166-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9926, ''Chiquita'', true, date (CURRENT_DATE) - integer ''3''),    --  141.8 * 0.7 = 99.26
        (67, 2, ''Ю-1-166-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9926, ''Chiquita'', true, date (CURRENT_DATE) - integer ''3''),
        (67, 3, ''З-1-166-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9926, ''Chiquita'', true, date (CURRENT_DATE) - integer ''3''),
        (67, 4, ''С-1-166-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9926, ''Chiquita'', true, date (CURRENT_DATE) - integer ''3''),
        (67, 5, ''В-1-166-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9926, ''Chiquita'', true, date (CURRENT_DATE) - integer ''3''),

        (68, 1, ''Ц-1-167-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),  --  110 -> 114
        (68, 2, ''Ю-1-167-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (68, 3, ''З-1-167-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (68, 4, ''С-1-167-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (68, 5, ''В-1-167-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),

        (69, 1, ''Ц-1-168-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),  --  100 -> 109
        (69, 2, ''Ю-1-168-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (69, 3, ''З-1-168-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (69, 4, ''С-1-168-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (69, 5, ''В-1-168-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),


        (70, 1, ''Ц-1-169-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),  --  130 -> 139.9
        (70, 2, ''Ю-1-169-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (70, 3, ''З-1-169-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (70, 4, ''С-1-169-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (70, 5, ''В-1-169-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),

        (71, 1, ''Ц-1-170-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),  --  110 -> 119.9
        (71, 2, ''Ю-1-170-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (71, 3, ''З-1-170-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (71, 4, ''С-1-170-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (71, 5, ''В-1-170-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11000, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),

        (72, 1, ''Ц-1-171-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18990, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),  --  189.9 * 0.7=132.9
        (72, 2, ''Ю-1-171-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18990, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (72, 3, ''З-1-171-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18990, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (72, 4, ''С-1-171-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18990, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (72, 5, ''В-1-171-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 18990, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),

        (73, 1, ''Ц-1-172-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 16990, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),  --  169.9 * 0.7= 118.9
        (73, 2, ''Ю-1-172-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 16990, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (73, 3, ''З-1-172-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 16990, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (73, 4, ''С-1-172-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 16990, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),
        (73, 5, ''В-1-172-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 16990, ''ЕВРОСНАБ АГРО'', true, date (CURRENT_DATE) - integer ''3''),

        (74, 1, ''Ц-1-173-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8260, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),    --  118.0 * 0.7= 82.6
        (74, 2, ''Ю-1-173-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8260, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (74, 3, ''З-1-173-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8260, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (74, 4, ''С-1-173-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8260, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (74, 5, ''В-1-173-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8260, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),

        (75, 1, ''Ц-1-174-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6990, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),    --  99.9 * 0.7= 69.9
        (75, 2, ''Ю-1-174-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6990, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (75, 3, ''З-1-174-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6990, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (75, 4, ''С-1-174-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6990, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (75, 5, ''В-1-174-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6990, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),

        (76, 1, ''Ц-1-175-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5280, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),    -- 75.50 * 0.7 = 52.80
        (76, 2, ''Ю-1-175-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5280, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (76, 3, ''З-1-175-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5280, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (76, 4, ''С-1-175-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5280, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (76, 5, ''В-1-175-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5280, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),

        (77, 1, ''Ц-1-176-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9300, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),    -- 75 -> 93
        (77, 2, ''Ю-1-176-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9300, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (77, 3, ''З-1-176-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9300, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (77, 4, ''С-1-176-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9300, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (77, 5, ''В-1-176-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9300, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),

        (78, 1, ''Ц-1-177-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8050, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),    -- 115 * 0.7 = 80.5
        (78, 2, ''Ю-1-177-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8050, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (78, 3, ''З-1-177-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8050, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (78, 4, ''С-1-177-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8050, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (78, 5, ''В-1-177-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8050, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),

        (79, 1, ''Ц-1-178-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10000, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),   --  100 -> 119
        (79, 2, ''Ю-1-178-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10000, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (79, 3, ''З-1-178-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10000, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (79, 4, ''С-1-178-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10000, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (79, 5, ''В-1-178-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10000, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),


        (80, 1, ''Ц-1-179-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10000, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),   --  143 * 0.7 =  100
        (80, 2, ''Ю-1-179-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10000, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (80, 3, ''З-1-179-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10000, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (80, 4, ''С-1-179-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10000, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),
        (80, 5, ''В-1-179-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10000, ''Мистраль'', true, date (CURRENT_DATE) - integer ''3''),

        (81, 1, ''Ц-1-180-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4340, ''Агро-Альянс'', true, date (CURRENT_DATE) - integer ''3''), --   62* 0.7 = 43.4
        (81, 2, ''Ю-1-180-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4340, ''Агро-Альянс'', true, date (CURRENT_DATE) - integer ''3''),
        (81, 3, ''З-1-180-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4340, ''Агро-Альянс'', true, date (CURRENT_DATE) - integer ''3''),
        (81, 4, ''С-1-180-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4340, ''Агро-Альянс'', true, date (CURRENT_DATE) - integer ''3''),
        (81, 5, ''В-1-180-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4340, ''Агро-Альянс'', true, date (CURRENT_DATE) - integer ''3''),

        (82, 1, ''Ц-1-181-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4970, ''Makfa'', true, date (CURRENT_DATE) - integer ''3''),   --   71.10 * 0.7 = 49.70
        (82, 2, ''Ю-1-181-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4970, ''Makfa'', true, date (CURRENT_DATE) - integer ''3''),
        (82, 3, ''З-1-181-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4970, ''Makfa'', true, date (CURRENT_DATE) - integer ''3''),
        (82, 4, ''С-1-181-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4970, ''Makfa'', true, date (CURRENT_DATE) - integer ''3''),
        (82, 5, ''В-1-181-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4970, ''Makfa'', true, date (CURRENT_DATE) - integer ''3''),

        (83, 1, ''Ц-1-182-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4130, ''Makfa'', true, date (CURRENT_DATE) - integer ''3''),   --  59 * 0.7 =41.3
        (83, 2, ''Ю-1-182-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4130, ''Makfa'', true, date (CURRENT_DATE) - integer ''3''),
        (83, 3, ''З-1-182-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4130, ''Makfa'', true, date (CURRENT_DATE) - integer ''3''),
        (83, 4, ''С-1-182-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4130, ''Makfa'', true, date (CURRENT_DATE) - integer ''3''),
        (83, 5, ''В-1-182-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4130, ''Makfa'', true, date (CURRENT_DATE) - integer ''3''),

        (84, 1, ''Ц-1-183-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5590, ''Makfa'', true, date (CURRENT_DATE) - integer ''3''),   --   79.9* 0.7 = 55.90
        (84, 2, ''Ю-1-183-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5590, ''Makfa'', true, date (CURRENT_DATE) - integer ''3''),
        (84, 3, ''З-1-183-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5590, ''Makfa'', true, date (CURRENT_DATE) - integer ''3''),
        (84, 4, ''С-1-183-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5590, ''Makfa'', true, date (CURRENT_DATE) - integer ''3''),
        (84, 5, ''В-1-183-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5590, ''Makfa'', true, date (CURRENT_DATE) - integer ''3''),

        (85, 1, ''Ц-1-184-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 1540, ''Полесье'', true, date (CURRENT_DATE) - integer ''3''), --   22.0 * 0.7 = 15.4
        (85, 2, ''Ю-1-184-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 1540, ''Полесье'', true, date (CURRENT_DATE) - integer ''3''),
        (85, 3, ''З-1-184-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 1540, ''Полесье'', true, date (CURRENT_DATE) - integer ''3''),
        (85, 4, ''С-1-184-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 1540, ''Полесье'', true, date (CURRENT_DATE) - integer ''3''),
        (85, 5, ''В-1-184-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 1540, ''Полесье'', true, date (CURRENT_DATE) - integer ''3''),

        (86, 1, ''Ц-1-185-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4500, ''Полесье'', true, date (CURRENT_DATE) - integer ''3''), --   64.40 * 0.7 = 45
        (86, 2, ''Ю-1-185-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4500, ''Полесье'', true, date (CURRENT_DATE) - integer ''3''),
        (86, 3, ''З-1-185-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4500, ''Полесье'', true, date (CURRENT_DATE) - integer ''3''),
        (86, 4, ''С-1-185-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4500, ''Полесье'', true, date (CURRENT_DATE) - integer ''3''),
        (86, 5, ''В-1-185-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4500, ''Полесье'', true, date (CURRENT_DATE) - integer ''3''),

        (87, 1, ''Ц-1-186-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4590, ''Восточный гость'', true, date (CURRENT_DATE) - integer ''3''), --  37 -> 45.9
        (87, 2, ''Ю-1-186-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4590, ''Восточный гость'', true, date (CURRENT_DATE) - integer ''3''),
        (87, 3, ''З-1-186-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4590, ''Восточный гость'', true, date (CURRENT_DATE) - integer ''3''),
        (87, 4, ''С-1-186-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4590, ''Восточный гость'', true, date (CURRENT_DATE) - integer ''3''),
        (87, 5, ''В-1-186-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4590, ''Восточный гость'', true, date (CURRENT_DATE) - integer ''3''),

        (88, 1, ''Ц-1-187-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4590, ''Восточный гость'', true, date (CURRENT_DATE) - integer ''3''), --   37 -> 45.9
        (88, 2, ''Ю-1-187-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4590, ''Восточный гость'', true, date (CURRENT_DATE) - integer ''3''),
        (88, 3, ''З-1-187-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4590, ''Восточный гость'', true, date (CURRENT_DATE) - integer ''3''),
        (88, 4, ''С-1-187-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4590, ''Восточный гость'', true, date (CURRENT_DATE) - integer ''3''),
        (88, 5, ''В-1-187-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4590, ''Восточный гость'', true, date (CURRENT_DATE) - integer ''3''),

        (89, 1, ''Ц-1-188-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9100, ''Рот-Фронт'', true, date (CURRENT_DATE) - integer ''3''),   --   130 * 0.7 = 91
        (89, 2, ''Ю-1-188-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9100, ''Рот-Фронт'', true, date (CURRENT_DATE) - integer ''3''),
        (89, 3, ''З-1-188-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9100, ''Рот-Фронт'', true, date (CURRENT_DATE) - integer ''3''),
        (89, 4, ''С-1-188-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9100, ''Рот-Фронт'', true, date (CURRENT_DATE) - integer ''3''),
        (89, 5, ''В-1-188-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 9100, ''Рот-Фронт'', true, date (CURRENT_DATE) - integer ''3''),

        (90, 1, ''Ц-1-189-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10500, ''Рот-Фронт'', true, date (CURRENT_DATE) - integer ''3''),  --   150* 0.7 = 105
        (90, 2, ''Ю-1-189-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10500, ''Рот-Фронт'', true, date (CURRENT_DATE) - integer ''3''),
        (90, 3, ''З-1-189-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10500, ''Рот-Фронт'', true, date (CURRENT_DATE) - integer ''3''),
        (90, 4, ''С-1-189-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10500, ''Рот-Фронт'', true, date (CURRENT_DATE) - integer ''3''),
        (90, 5, ''В-1-189-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 10500, ''Рот-Фронт'', true, date (CURRENT_DATE) - integer ''3''),

        (91, 1, ''Ц-1-190-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11000, ''Рот-Фронт'', true, date (CURRENT_DATE) - integer ''3''),  --   110 -> 110
        (91, 2, ''Ю-1-190-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11000, ''Рот-Фронт'', true, date (CURRENT_DATE) - integer ''3''),
        (91, 3, ''З-1-190-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11000, ''Рот-Фронт'', true, date (CURRENT_DATE) - integer ''3''),
        (91, 4, ''С-1-190-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11000, ''Рот-Фронт'', true, date (CURRENT_DATE) - integer ''3''),
        (91, 5, ''В-1-190-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11000, ''Рот-Фронт'', true, date (CURRENT_DATE) - integer ''3''),

        (92, 1, ''Ц-1-191-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5270, ''Юбилейное'', true, date (CURRENT_DATE) - integer ''3''),   --   75.4 * 0.7 = 52.7
        (92, 2, ''Ю-1-191-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5270, ''Юбилейное'', true, date (CURRENT_DATE) - integer ''3''),
        (92, 3, ''З-1-191-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5270, ''Юбилейное'', true, date (CURRENT_DATE) - integer ''3''),
        (92, 4, ''С-1-191-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5270, ''Юбилейное'', true, date (CURRENT_DATE) - integer ''3''),
        (92, 5, ''В-1-191-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 5270, ''Юбилейное'', true, date (CURRENT_DATE) - integer ''3''),

        (93, 1, ''Ц-1-192-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8190, ''Юбилейное'', true, date (CURRENT_DATE) - integer ''3''),   --   117 * 0.7 = 81.9
        (93, 2, ''Ю-1-192-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8190, ''Юбилейное'', true, date (CURRENT_DATE) - integer ''3''),
        (93, 3, ''З-1-192-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8190, ''Юбилейное'', true, date (CURRENT_DATE) - integer ''3''),
        (93, 4, ''С-1-192-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8190, ''Юбилейное'', true, date (CURRENT_DATE) - integer ''3''),
        (93, 5, ''В-1-192-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 8190, ''Юбилейное'', true, date (CURRENT_DATE) - integer ''3''),

        (94, 1, ''Ц-1-193-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6760, ''Бискотти'', true, date (CURRENT_DATE) - integer ''3''),    --  96.6 * 0.7 = 67.6
        (94, 2, ''Ю-1-193-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6760, ''Бискотти'', true, date (CURRENT_DATE) - integer ''3''),
        (94, 3, ''З-1-193-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6760, ''Бискотти'', true, date (CURRENT_DATE) - integer ''3''),
        (94, 4, ''С-1-193-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6760, ''Бискотти'', true, date (CURRENT_DATE) - integer ''3''),
        (94, 5, ''В-1-193-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6760, ''Бискотти'', true, date (CURRENT_DATE) - integer ''3''),

        (95, 1, ''Ц-1-194-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7590, ''Greenfield'', true, date (CURRENT_DATE) - integer ''3''),  --   100 -> 75.9
        (95, 2, ''Ю-1-194-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7590, ''Greenfield'', true, date (CURRENT_DATE) - integer ''3''),
        (95, 3, ''З-1-194-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7590, ''Greenfield'', true, date (CURRENT_DATE) - integer ''3''),
        (95, 4, ''С-1-194-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7590, ''Greenfield'', true, date (CURRENT_DATE) - integer ''3''),
        (95, 5, ''В-1-194-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7590, ''Greenfield'', true, date (CURRENT_DATE) - integer ''3''),

        (96, 1, ''Ц-1-195-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7630, ''Greenfield'', true, date (CURRENT_DATE) - integer ''3''),  --   109 * 0.7 = 76.3
        (96, 2, ''Ю-1-195-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7630, ''Greenfield'', true, date (CURRENT_DATE) - integer ''3''),
        (96, 3, ''З-1-195-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7630, ''Greenfield'', true, date (CURRENT_DATE) - integer ''3''),
        (96, 4, ''С-1-195-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7630, ''Greenfield'', true, date (CURRENT_DATE) - integer ''3''),
        (96, 5, ''В-1-195-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7630, ''Greenfield'', true, date (CURRENT_DATE) - integer ''3''),

        (97, 1, ''Ц-1-196-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 35000, ''Jacobs'', true, date (CURRENT_DATE) - integer ''3''), --   350 -> 399.0
        (97, 2, ''Ю-1-196-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 35000, ''Jacobs'', true, date (CURRENT_DATE) - integer ''3''),
        (97, 3, ''З-1-196-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 35000, ''Jacobs'', true, date (CURRENT_DATE) - integer ''3''),
        (97, 4, ''С-1-196-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 35000, ''Jacobs'', true, date (CURRENT_DATE) - integer ''3''),
        (97, 5, ''В-1-196-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 35000, ''Jacobs'', true, date (CURRENT_DATE) - integer ''3''),

        (98, 1, ''Ц-1-197-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 20000, ''Egoiste Noir'', true, date (CURRENT_DATE) - integer ''3''),   --  200 -> 179
        (98, 2, ''Ю-1-197-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 20000, ''Egoiste Noir'', true, date (CURRENT_DATE) - integer ''3''),
        (98, 3, ''З-1-197-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 20000, ''Egoiste Noir'', true, date (CURRENT_DATE) - integer ''3''),
        (98, 4, ''С-1-197-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 20000, ''Egoiste Noir'', true, date (CURRENT_DATE) - integer ''3''),
        (98, 5, ''В-1-197-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 20000, ''Egoiste Noir'', true, date (CURRENT_DATE) - integer ''3''),

        (99, 1, ''Ц-1-198-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 22000, ''Мираторг'', true, date (CURRENT_DATE) - integer ''3''),   --   220 -> 259
        (99, 2, ''Ю-1-198-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 22000, ''Мираторг'', true, date (CURRENT_DATE) - integer ''3''),
        (99, 3, ''З-1-198-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 22000, ''Мираторг'', true, date (CURRENT_DATE) - integer ''3''),
        (99, 4, ''С-1-198-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 22000, ''Мираторг'', true, date (CURRENT_DATE) - integer ''3''),
        (99, 5, ''В-1-198-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 22000, ''Мираторг'', true, date (CURRENT_DATE) - integer ''3''),

        (100, 1, ''Ц-1-199-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 19880, ''Мираторг'', true, date (CURRENT_DATE) - integer ''3''),  --   284 * 0.7 = 198.8
        (100, 2, ''Ю-1-199-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 19880, ''Мираторг'', true, date (CURRENT_DATE) - integer ''3''),
        (100, 3, ''З-1-199-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 19880, ''Мираторг'', true, date (CURRENT_DATE) - integer ''3''),
        (100, 4, ''С-1-199-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 19880, ''Мираторг'', true, date (CURRENT_DATE) - integer ''3''),
        (100, 5, ''В-1-199-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 19880, ''Мираторг'', true, date (CURRENT_DATE) - integer ''3''),

        (101, 1, ''Ц-1-200-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 52430, ''Мираторг'', true, date (CURRENT_DATE) - integer ''3''),  --  749 * 0.7 = 524.3
        (101, 2, ''Ю-1-200-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 52430, ''Мираторг'', true, date (CURRENT_DATE) - integer ''3''),
        (101, 3, ''З-1-200-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 52430, ''Мираторг'', true, date (CURRENT_DATE) - integer ''3''),
        (101, 4, ''С-1-200-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 52430, ''Мираторг'', true, date (CURRENT_DATE) - integer ''3''),
        (101, 5, ''В-1-200-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 52430, ''Мираторг'', true, date (CURRENT_DATE) - integer ''3''),

        (102, 1, ''Ц-1-201-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 19740, ''Останкино'', true, date (CURRENT_DATE) - integer ''3''), --   282* 0.7 = 197.4
        (102, 2, ''Ю-1-201-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 19740, ''Останкино'', true, date (CURRENT_DATE) - integer ''3''),
        (102, 3, ''З-1-201-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 19740, ''Останкино'', true, date (CURRENT_DATE) - integer ''3''),
        (102, 4, ''С-1-201-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 19740, ''Останкино'', true, date (CURRENT_DATE) - integer ''3''),
        (102, 5, ''В-1-201-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 19740, ''Останкино'', true, date (CURRENT_DATE) - integer ''3''),

        (103, 1, ''Ц-1-202-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 51975, ''Останкино'', true, date (CURRENT_DATE) - integer ''3''), --   742.5 * 0.7 = 519.75
        (103, 2, ''Ю-1-202-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 51975, ''Останкино'', true, date (CURRENT_DATE) - integer ''3''),
        (103, 3, ''З-1-202-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 51975, ''Останкино'', true, date (CURRENT_DATE) - integer ''3''),
        (103, 4, ''С-1-202-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 51975, ''Останкино'', true, date (CURRENT_DATE) - integer ''3''),
        (103, 5, ''В-1-202-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 51975, ''Останкино'', true, date (CURRENT_DATE) - integer ''3''),

        (104, 1, ''Ц-1-203-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 50862, ''Останкино'', true, date (CURRENT_DATE) - integer ''3''), --   726.6 * 0.7 = 508.62
        (104, 2, ''Ю-1-203-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 50862, ''Останкино'', true, date (CURRENT_DATE) - integer ''3''),
        (104, 3, ''З-1-203-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 50862, ''Останкино'', true, date (CURRENT_DATE) - integer ''3''),
        (104, 4, ''С-1-203-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 50862, ''Останкино'', true, date (CURRENT_DATE) - integer ''3''),
        (104, 5, ''В-1-203-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 50862, ''Останкино'', true, date (CURRENT_DATE) - integer ''3''),

        (105, 1, ''Ц-1-204-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 27468, ''Ближние горки'', true, date (CURRENT_DATE) - integer ''3''), --   392.4 * 0.7 = 274,68
        (105, 2, ''Ю-1-204-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 27468, ''Ближние горки'', true, date (CURRENT_DATE) - integer ''3''),
        (105, 3, ''З-1-204-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 27468, ''Ближние горки'', true, date (CURRENT_DATE) - integer ''3''),
        (105, 4, ''С-1-204-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 27468, ''Ближние горки'', true, date (CURRENT_DATE) - integer ''3''),
        (105, 5, ''В-1-204-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 27468, ''Ближние горки'', true, date (CURRENT_DATE) - integer ''3''),

        (106, 1, ''Ц-1-205-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 26670, ''Кудашка'', true, date (CURRENT_DATE) - integer ''3''),   --   266.7 -> 362
        (106, 2, ''Ю-1-205-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 26670, ''Кудашка'', true, date (CURRENT_DATE) - integer ''3''),
        (106, 3, ''З-1-205-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 26670, ''Кудашка'', true, date (CURRENT_DATE) - integer ''3''),
        (106, 4, ''С-1-205-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 26670, ''Кудашка'', true, date (CURRENT_DATE) - integer ''3''),
        (106, 5, ''В-1-205-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 26670, ''Кудашка'', true, date (CURRENT_DATE) - integer ''3''),

        (107, 1, ''Ц-1-206-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 21280, ''Петелинка'', true, date (CURRENT_DATE) - integer ''3''), --   212.8 -> 251
        (107, 2, ''Ю-1-206-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 21280, ''Петелинка'', true, date (CURRENT_DATE) - integer ''3''),
        (107, 3, ''З-1-206-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 21280, ''Петелинка'', true, date (CURRENT_DATE) - integer ''3''),
        (107, 4, ''С-1-206-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 21280, ''Петелинка'', true, date (CURRENT_DATE) - integer ''3''),
        (107, 5, ''В-1-206-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 21280, ''Петелинка'', true, date (CURRENT_DATE) - integer ''3''),

        (108, 1, ''Ц-1-207-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 38500, ''Петелинка'', true, date (CURRENT_DATE) - integer ''3''), --   550 * 0.7 = 385
        (108, 2, ''Ю-1-207-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 38500, ''Петелинка'', true, date (CURRENT_DATE) - integer ''3''),
        (108, 3, ''З-1-207-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 38500, ''Петелинка'', true, date (CURRENT_DATE) - integer ''3''),
        (108, 4, ''С-1-207-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 38500, ''Петелинка'', true, date (CURRENT_DATE) - integer ''3''),
        (108, 5, ''В-1-207-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 38500, ''Петелинка'', true, date (CURRENT_DATE) - integer ''3''),

        (109, 1, ''Ц-1-208-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 16700, ''Клинский'', true, date (CURRENT_DATE) - integer ''3''),  --   163.1 -> 167
        (109, 2, ''Ю-1-208-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 16700, ''Клинский'', true, date (CURRENT_DATE) - integer ''3''),
        (109, 3, ''З-1-208-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 16700, ''Клинский'', true, date (CURRENT_DATE) - integer ''3''),
        (109, 4, ''С-1-208-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 16700, ''Клинский'', true, date (CURRENT_DATE) - integer ''3''),
        (109, 5, ''В-1-208-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 16700, ''Клинский'', true, date (CURRENT_DATE) - integer ''3''),

        (110, 1, ''Ц-1-209-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 20900, ''Папа Может'', true, date (CURRENT_DATE) - integer ''3''),    --   243.6 -> 209
        (110, 2, ''Ю-1-209-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 20900, ''Папа Может'', true, date (CURRENT_DATE) - integer ''3''),
        (110, 3, ''З-1-209-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 20900, ''Папа Может'', true, date (CURRENT_DATE) - integer ''3''),
        (110, 4, ''С-1-209-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 20900, ''Папа Может'', true, date (CURRENT_DATE) - integer ''3''),
        (110, 5, ''В-1-209-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 20900, ''Папа Может'', true, date (CURRENT_DATE) - integer ''3''),

        (111, 1, ''Ц-1-210-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11690, ''Атяшево'', true, date (CURRENT_DATE) - integer ''3''),   --   167 * 0.7 = 116.9
        (111, 2, ''Ю-1-210-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11690, ''Атяшево'', true, date (CURRENT_DATE) - integer ''3''),
        (111, 3, ''З-1-210-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11690, ''Атяшево'', true, date (CURRENT_DATE) - integer ''3''),
        (111, 4, ''С-1-210-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11690, ''Атяшево'', true, date (CURRENT_DATE) - integer ''3''),
        (111, 5, ''В-1-210-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11690, ''Атяшево'', true, date (CURRENT_DATE) - integer ''3''),

        (112, 1, ''Ц-1-211-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11690, ''Атяшево'', true, date (CURRENT_DATE) - integer ''3''),   --   167 * 0.7 = 116.9
        (112, 2, ''Ю-1-211-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11690, ''Атяшево'', true, date (CURRENT_DATE) - integer ''3''),
        (112, 3, ''З-1-211-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11690, ''Атяшево'', true, date (CURRENT_DATE) - integer ''3''),
        (112, 4, ''С-1-211-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11690, ''Атяшево'', true, date (CURRENT_DATE) - integer ''3''),
        (112, 5, ''В-1-211-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 11690, ''Атяшево'', true, date (CURRENT_DATE) - integer ''3''),

        (113, 1, ''Ц-1-212-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 34400, ''Русское море'', true, date (CURRENT_DATE) - integer ''3''),  --   265.3 -> 344
        (113, 2, ''Ю-1-212-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 34400, ''Русское море'', true, date (CURRENT_DATE) - integer ''3''),
        (113, 3, ''З-1-212-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 34400, ''Русское море'', true, date (CURRENT_DATE) - integer ''3''),
        (113, 4, ''С-1-212-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 34400, ''Русское море'', true, date (CURRENT_DATE) - integer ''3''),
        (113, 5, ''В-1-212-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 34400, ''Русское море'', true, date (CURRENT_DATE) - integer ''3''),

        (114, 1, ''Ц-1-213-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13100, ''Русское море'', true, date (CURRENT_DATE) - integer ''3''),  --   105.7 -> 131
        (114, 2, ''Ю-1-213-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13100, ''Русское море'', true, date (CURRENT_DATE) - integer ''3''),
        (114, 3, ''З-1-213-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13100, ''Русское море'', true, date (CURRENT_DATE) - integer ''3''),
        (114, 4, ''С-1-213-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13100, ''Русское море'', true, date (CURRENT_DATE) - integer ''3''),
        (114, 5, ''В-1-213-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 13100, ''Русское море'', true, date (CURRENT_DATE) - integer ''3''),

        (115, 1, ''Ц-1-214-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 17710, ''Fish & More'', true, date (CURRENT_DATE) - integer ''3''),   --   177.1 -> 229
        (115, 2, ''Ю-1-214-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 17710, ''Fish & More'', true, date (CURRENT_DATE) - integer ''3''),
        (115, 3, ''З-1-214-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 17710, ''Fish & More'', true, date (CURRENT_DATE) - integer ''3''),
        (115, 4, ''С-1-214-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 17710, ''Fish & More'', true, date (CURRENT_DATE) - integer ''3''),
        (115, 5, ''В-1-214-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 17710, ''Fish & More'', true, date (CURRENT_DATE) - integer ''3''),

        (116, 1, ''Ц-1-215-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 50600, ''Agama'', true, date (CURRENT_DATE) - integer ''3''), --   580* 0.7 =506
        (116, 2, ''Ю-1-215-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 50600, ''Agama'', true, date (CURRENT_DATE) - integer ''3''),
        (116, 3, ''З-1-215-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 50600, ''Agama'', true, date (CURRENT_DATE) - integer ''3''),
        (116, 4, ''С-1-215-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 50600, ''Agama'', true, date (CURRENT_DATE) - integer ''3''),
        (116, 5, ''В-1-215-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 50600, ''Agama'', true, date (CURRENT_DATE) - integer ''3''),

        (117, 1, ''Ц-1-216-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 14980, ''Русское море'', true, date (CURRENT_DATE) - integer ''3''),  --   214* 0.7 = 149.8
        (117, 2, ''Ю-1-216-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 14980, ''Русское море'', true, date (CURRENT_DATE) - integer ''3''),
        (117, 3, ''З-1-216-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 14980, ''Русское море'', true, date (CURRENT_DATE) - integer ''3''),
        (117, 4, ''С-1-216-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 14980, ''Русское море'', true, date (CURRENT_DATE) - integer ''3''),
        (117, 5, ''В-1-216-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 14980, ''Русское море'', true, date (CURRENT_DATE) - integer ''3''),

        (118, 1, ''Ц-1-217-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7630, ''Слобода'', true, date (CURRENT_DATE) - integer ''3''),    --   109* 0.7 = 76.3
        (118, 2, ''Ю-1-217-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7630, ''Слобода'', true, date (CURRENT_DATE) - integer ''3''),
        (118, 3, ''З-1-217-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7630, ''Слобода'', true, date (CURRENT_DATE) - integer ''3''),
        (118, 4, ''С-1-217-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7630, ''Слобода'', true, date (CURRENT_DATE) - integer ''3''),
        (118, 5, ''В-1-217-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 7630, ''Слобода'', true, date (CURRENT_DATE) - integer ''3''),

        (119, 1, ''Ц-1-218-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4330, ''Махеевъ'', true, date (CURRENT_DATE) - integer ''3''),    --   61.9* 0.7 =43.3
        (119, 2, ''Ю-1-218-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4330, ''Махеевъ'', true, date (CURRENT_DATE) - integer ''3''),
        (119, 3, ''З-1-218-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4330, ''Махеевъ'', true, date (CURRENT_DATE) - integer ''3''),
        (119, 4, ''С-1-218-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4330, ''Махеевъ'', true, date (CURRENT_DATE) - integer ''3''),
        (119, 5, ''В-1-218-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 4330, ''Махеевъ'', true, date (CURRENT_DATE) - integer ''3''),

        (120, 1, ''Ц-1-219-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6290, ''Кухмастер'', true, date (CURRENT_DATE) - integer ''3''),  --   82.9* 0.7 =62.9
        (120, 2, ''Ю-1-219-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6290, ''Кухмастер'', true, date (CURRENT_DATE) - integer ''3''),
        (120, 3, ''З-1-219-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6290, ''Кухмастер'', true, date (CURRENT_DATE) - integer ''3''),
        (120, 4, ''С-1-219-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6290, ''Кухмастер'', true, date (CURRENT_DATE) - integer ''3''),
        (120, 5, ''В-1-219-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6290, ''Кухмастер'', true, date (CURRENT_DATE) - integer ''3''),

        (121, 1, ''Ц-1-220-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6010, ''Heinz'', true, date (CURRENT_DATE) - integer ''3''),  --  85.9 * 0.7 = 60.1
        (121, 2, ''Ю-1-220-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6010, ''Heinz'', true, date (CURRENT_DATE) - integer ''3''),
        (121, 3, ''З-1-220-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6010, ''Heinz'', true, date (CURRENT_DATE) - integer ''3''),
        (121, 4, ''С-1-220-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6010, ''Heinz'', true, date (CURRENT_DATE) - integer ''3''),
        (121, 5, ''В-1-220-Л'', 100, 50, date (CURRENT_DATE) - integer ''3'', 6010, ''Heinz'', true, date (CURRENT_DATE) - integer ''3'');

END IF;
END;
' language plpgsql;


DO ' DECLARE
BEGIN
    IF NOT EXISTS (SELECT 1 FROM orders WHERE order_id = 1) THEN
        INSERT INTO orders(client_id, address, coordinates, warehouse_id, courier_id, status, date_start, date_end, overall_cost, promo_code_id, discount)
        VALUES
            -- заказы с центрального склада,
            (2, ''42-й квартал, район Арбат'', ST_SetSRID(ST_MakePoint(37.607515, 55.754582), 4326), 1, 52, ''CANCELLED'', CURRENT_DATE - integer ''3'' + time ''14:19'', CURRENT_DATE - integer ''3'' + time ''14:20'', 587.09, NULL, 0 ),
            (2, ''42-й квартал, район Арбат'', ST_SetSRID(ST_MakePoint(37.607513, 55.754582), 4326), 1, 52, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''09:02'', CURRENT_DATE - integer ''3'' + time ''09:30'', 349.20, NULL, 0 ),
            (2, ''42-й квартал, район Арбат'', ST_SetSRID(ST_MakePoint(37.607512, 55.754582), 4326), 1, 52, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''18:10'', CURRENT_DATE - integer ''3'' + time ''18:47'', 324.69, NULL, 0 ),
            (2, ''42-й квартал, район Арбат'', ST_SetSRID(ST_MakePoint(37.607513, 55.754583), 4326), 1, 54, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''10:22'', CURRENT_DATE - integer ''2'' + time ''10:49'', 817.80, NULL, 0 ),
            (2, ''42-й квартал, район Арбат'', ST_SetSRID(ST_MakePoint(37.607513, 55.754582), 4326), 1, 54, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''15:26'', CURRENT_DATE - integer ''2'' + time ''15:50'', 525.05, NULL, 0 ),
            (2, ''42-й квартал, район Арбат'', ST_SetSRID(ST_MakePoint(37.607513, 55.754582), 4326), 1, 55, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''19:22'', CURRENT_DATE - integer ''2'' + time ''19:54'', 1019.40, NULL, 0),
            (2, ''42-й квартал, район Арбат'', ST_SetSRID(ST_MakePoint(37.607513, 55.754582), 4326), 1, 55, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''22:01'', CURRENT_DATE - integer ''2'' + time ''22:40'', 1571.26, NULL, 0),
            (2, ''42-й квартал, район Арбат'', ST_SetSRID(ST_MakePoint(37.607513, 55.754582), 4326), 1, 53, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''10:22'', CURRENT_DATE - integer ''1'' + time ''10:49'', 971.20, NULL, 0),
            (2, ''42-й квартал, район Арбат'', ST_SetSRID(ST_MakePoint(37.607513, 55.754582), 4326), 1, 53, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''14:21'', CURRENT_DATE - integer ''1'' + time ''14:59'', 592.50, NULL, 0),
            (2, ''42-й квартал, район Арбат'', ST_SetSRID(ST_MakePoint(37.607513, 55.754582), 4326), 1, 53, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''20:53'', CURRENT_DATE - integer ''1'' + time ''21:29'', 689.70, NULL, 0),

            (3, ''Берниковская набережная, 14'', ST_SetSRID(ST_MakePoint(37.652256, 55.748883), 4326), 1, 52, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''09:32'', CURRENT_DATE - integer ''3'' + time ''09:57'', 447.80, NULL, 0),
            (4, ''Берниковская набережная, 14'', ST_SetSRID(ST_MakePoint(37.652253, 55.748884), 4326), 1, 53, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''09:02'', CURRENT_DATE - integer ''3'' + time ''09:40'', 371.40, NULL, 0),
            (5, ''Берниковская набережная, 14'', ST_SetSRID(ST_MakePoint(37.652254, 55.748882), 4326), 1, 54, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''08:59'', CURRENT_DATE - integer ''3'' + time ''09:30'', 607.20, NULL, 0),
            (6, ''Берниковская набережная, 14'', ST_SetSRID(ST_MakePoint(37.652255, 55.748886), 4326), 1, 55, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''16:22'', CURRENT_DATE - integer ''3'' + time ''16:56'', 759.60, NULL, 0),
            (7, ''Берниковская набережная, 14'', ST_SetSRID(ST_MakePoint(37.652257, 55.748883), 4326), 1, 52, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''10:00'', CURRENT_DATE - integer ''2'' + time ''10:30'', 457.20, NULL, 0),
            (8, ''Берниковская набережная, 14'', ST_SetSRID(ST_MakePoint(37.652258, 55.748885), 4326), 1, 53, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''15:02'', CURRENT_DATE - integer ''2'' + time ''15:45'', 983.80, NULL, 0),
            (9, ''Берниковская набережная, 14'', ST_SetSRID(ST_MakePoint(37.652256, 55.748881), 4326), 1, 54, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''11:03'', CURRENT_DATE - integer ''2'' + time ''11:32'', 527.40, NULL, 0),
            (10,''Берниковская набережная, 14'' ,ST_SetSRID(ST_MakePoint(37.652251, 55.748883), 4326) ,1 ,55 ,''DELIVERED'' ,CURRENT_DATE - integer ''1'' + time ''09:02'', CURRENT_DATE - integer ''1'' + time ''09:30'', 488.80, NULL, 0),
            (11,''Берниковская набережная, 14'' ,ST_SetSRID(ST_MakePoint(37.652252, 55.748884), 4326) ,1 ,52 ,''DELIVERED'' ,CURRENT_DATE - integer ''1'' + time ''20:02'', CURRENT_DATE - integer ''1'' + time ''20:38'', 674.80, 24, 10.0),
            (12,''Берниковская набережная, 14'' ,ST_SetSRID(ST_MakePoint(37.652253, 55.748883), 4326) ,1 ,53 ,''DELIVERED'' ,CURRENT_DATE - integer ''1'' + time ''11:04'', CURRENT_DATE - integer ''1'' + time ''11:29'', 802.40, NULL, 0),


            -- заказы с южного склада

            (33, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607513, 55.754582), 4326), 2, NULL, ''CANCELLED'', CURRENT_DATE - integer ''3'' + time ''09:29'', CURRENT_DATE - integer ''3'' + time ''09:30'', 478.90, NULL, 0),
            (34, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607516, 55.754583), 4326), 2, 56, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''09:34'', CURRENT_DATE - integer ''3'' + time ''10:00'',   922.40, NULL, 0),
            (37, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607518, 55.754582), 4326), 2, 56, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''10:02'', CURRENT_DATE - integer ''3'' + time ''10:40'',   1316.40, NULL, 0),
            (36, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607511, 55.754581), 4326), 2, 56, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''12:22'', CURRENT_DATE - integer ''1'' + time ''12:50'',   398.10, NULL, 0),
            (37, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607512, 55.754583), 4326), 2, 56, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''12:55'', CURRENT_DATE - integer ''1'' + time ''13:30'',   537.0, NULL, 0),

            (38, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607514, 55.754584), 4326), 2, 57, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''12:05'', CURRENT_DATE - integer ''3'' + time ''12:36'', 1456.60, NULL, 0),
            (39, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607515, 55.754585), 4326), 2, 57, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''12:55'', CURRENT_DATE - integer ''3'' + time ''13:32'', 677.80, NULL, 0),
            (40, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607514, 55.754582), 4326), 2, 57, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''19:00'', CURRENT_DATE - integer ''2'' + time ''19:42'', 824.10, NULL, 0),
            (41, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607511, 55.754581), 4326), 2, 57, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''10:55'', CURRENT_DATE - integer ''1'' + time ''11:35'', 501.30, NULL, 0),
            (42, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607510, 55.754586), 4326), 2, 57, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''11:40'', CURRENT_DATE - integer ''1'' + time ''12:11'', 758.50, NULL, 0),

            (43, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607515, 55.754584), 4326), 2, 58, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''09:17'', CURRENT_DATE - integer ''3'' + time ''09:40'', 643.00, NULL, 0),
            (44, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607516, 55.754581), 4326), 2, 58, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''09:42'', CURRENT_DATE - integer ''3'' + time ''10:05'', 523.10, NULL, 0),
            (44, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607511, 55.754583), 4326), 2, 58, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''10:07'', CURRENT_DATE - integer ''3'' + time ''10:50'', 804.00, 24, 10.0),
            (46, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607513, 55.754582), 4326), 2, 58, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''10:53'', CURRENT_DATE - integer ''3'' + time ''11:29'', 583.80, NULL, 0),
            (47, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607514, 55.754584), 4326), 2, 58, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''19:07'', CURRENT_DATE - integer ''1'' + time ''19:47'', 746.10, NULL, 0),

            (48, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607515, 55.754582), 4326), 2, 59, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''08:57'', CURRENT_DATE - integer ''1'' + time ''09:30'', 731.50, NULL, 0),
            (49, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607515, 55.754581), 4326), 2, 59, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''09:34'', CURRENT_DATE - integer ''1'' + time ''10:01'', 1070.20, NULL, 0),
            (50, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607516, 55.754583), 4326), 2, 59, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''10:06'', CURRENT_DATE - integer ''1'' + time ''10:32'', 415.10, NULL, 0),
            (51, ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607511, 55.754584), 4326), 2, 59, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''10:37'', CURRENT_DATE - integer ''1'' + time ''11:01'', 533.80, NULL, 0),
            (3 , ''Каширский проезд, 25к2'', ST_SetSRID(ST_MakePoint(37.607514, 55.754585), 4326), 2, 59, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''11:02'', CURRENT_DATE - integer ''1'' + time ''11:39'', 432.80, NULL, 0),

            -- заказы с западного склада

            (4 , ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482154, 55.757318), 4326), 3, 60, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''09:01'', CURRENT_DATE - integer ''3'' + time ''09:30'', 535.90, NULL, 0),
            (5 , ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482150, 55.757319), 4326), 3, 60, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''09:32'', CURRENT_DATE - integer ''3'' + time ''09:59'', 480.80, NULL, 0),
            (6 , ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482151, 55.757310), 4326), 3, 60, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''10:02'', CURRENT_DATE - integer ''3'' + time ''10:39'', 586.70, NULL, 0),
            (7 , ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482152, 55.757311), 4326), 3, 60, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''16:02'', CURRENT_DATE - integer ''2'' + time ''16:45'', 751.90, NULL, 0),
            (8 , ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482153, 55.757312), 4326), 3, 60, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''16:48'', CURRENT_DATE - integer ''2'' + time ''17:36'', 492.0, NULL, 0),

            (9 , ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482154, 55.757313), 4326), 3, 61, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''10:22'', CURRENT_DATE - integer ''3'' + time ''10:58'', 643.70, NULL, 0),
            (10, ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482155, 55.757314), 4326), 3, NULL, ''CANCELLED'', CURRENT_DATE - integer ''3'' + time ''11:02'', CURRENT_DATE - integer ''3'' + time ''11:04'', 606.70, NULL, 0),
            (11, ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482156, 55.757315), 4326), 3, 61, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''11:06'', CURRENT_DATE - integer ''3'' + time ''11:45'', 465.00, NULL, 0),
            (12, ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482157, 55.757316), 4326), 3, 61, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''21:02'', CURRENT_DATE - integer ''1'' + time ''21:40'', 707.70, NULL, 0),
            (13, ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482158, 55.757317), 4326), 3, 61, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''21:42'', CURRENT_DATE - integer ''1'' + time ''22:34'', 373.60, NULL, 0),

            (14, ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482151, 55.757310), 4326), 3, 62, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''20:25'', CURRENT_DATE - integer ''2'' + time ''20:56'', 1233.90, NULL, 0),
            (15, ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482152, 55.757311), 4326), 3, 62, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''21:00'', CURRENT_DATE - integer ''2'' + time ''21:39'', 748.70, 4, 50.0),
            (16, ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482153, 55.757312), 4326), 3, 62, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''13:22'', CURRENT_DATE - integer ''1'' + time ''13:59'', 474.60, NULL, 0),
            (17, ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482154, 55.757313), 4326), 3, 62, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''15:01'', CURRENT_DATE - integer ''1'' + time ''15:48'', 721.40, 5, 50.0),
            (18, ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482155, 55.757314), 4326), 3, 62, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''15:50'', CURRENT_DATE - integer ''1'' + time ''16:34'', 972.40, NULL, 0),

            (19, ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482156, 55.757315), 4326), 3, 63, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''16:43'', CURRENT_DATE - integer ''2'' + time ''17:20'', 370.60, 6, 50.0),
            (20, ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482157, 55.757316), 4326), 3, 63, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''17:22'', CURRENT_DATE - integer ''2'' + time ''17:58'', 544.90, NULL, 0),
            (21, ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482158, 55.757317), 4326), 3, 63, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''18:00'', CURRENT_DATE - integer ''2'' + time ''18:46'', 793.80, 7, 50.0),
            (22, ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482159, 55.757318), 4326), 3, 63, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''20:01'', CURRENT_DATE - integer ''2'' + time ''20:34'', 1724.70, NULL, 0),
            (23, ''Новозаводская улица, 18с144'', ST_SetSRID(ST_MakePoint(37.482150, 55.757319), 4326), 3, 63, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''20:35'', CURRENT_DATE - integer ''2'' + time ''21:02'', 481.80, NULL, 0),

            -- заказы с северного склада

            (24, ''Олонецкая улица, 17'', ST_SetSRID(ST_MakePoint(37.618241, 55.853279), 4326), 4, 64, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''12:10'', CURRENT_DATE - integer ''3'' + time ''12:48'', 405.69, 8, 50.0),
            (25, ''Олонецкая улица, 17'', ST_SetSRID(ST_MakePoint(37.618242, 55.853278), 4326), 4, 64, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''12:51'', CURRENT_DATE - integer ''3'' + time ''13:30'', 897.60, NULL, 0),
            (26, ''Олонецкая улица, 17'', ST_SetSRID(ST_MakePoint(37.618243, 55.853277), 4326), 4, 64, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''13:32'', CURRENT_DATE - integer ''3'' + time ''14:11'', 899.80, 9, 50.0),
            (27, ''Олонецкая улица, 17'', ST_SetSRID(ST_MakePoint(37.618244, 55.853276), 4326), 4, 64, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''14:22'', CURRENT_DATE - integer ''2'' + time ''14:57'', 341.30, NULL, 0),
            (28, ''Олонецкая улица, 17'', ST_SetSRID(ST_MakePoint(37.618245, 55.853275), 4326), 4, 64, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''14:59'', CURRENT_DATE - integer ''2'' + time ''15:45'', 830.50, 10, 50.0),

            (29, ''Олонецкая улица, 17'', ST_SetSRID(ST_MakePoint(37.618246, 55.853278), 4326), 4, 65, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''16:12'', CURRENT_DATE - integer ''3'' + time ''16:56'', 1702.40, NULL, 0),
            (30, ''Олонецкая улица, 17'', ST_SetSRID(ST_MakePoint(37.618247, 55.853277), 4326), 4, 65, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''16:59'', CURRENT_DATE - integer ''3'' + time ''17:41'', 468.60, 11, 50.0),
            (31, ''Олонецкая улица, 17'', ST_SetSRID(ST_MakePoint(37.618248, 55.853276), 4326), 4, 65, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''09:42'', CURRENT_DATE - integer ''1'' + time ''10:29'', 845.70, NULL, 0),
            (32, ''Олонецкая улица, 17'', ST_SetSRID(ST_MakePoint(37.618249, 55.853275), 4326), 4, 65, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''10:34'', CURRENT_DATE - integer ''1'' + time ''11:11'', 833.60, 12, 50.0),
            (33, ''Олонецкая улица, 17'', ST_SetSRID(ST_MakePoint(37.618240, 55.853274), 4326), 4, 65, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''11:15'', CURRENT_DATE - integer ''1'' + time ''11:58'', 749.30, NULL, 0),

            (34, ''Олонецкая улица, 15'', ST_SetSRID(ST_MakePoint(37.617640, 55.852525), 4326), 4, 66, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''11:12'', CURRENT_DATE - integer ''2'' + time ''11:57'', 1539.70, NULL, 0),
            (34, ''Олонецкая улица, 15'', ST_SetSRID(ST_MakePoint(37.617641, 55.852528), 4326), 4, 66, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''12:02'', CURRENT_DATE - integer ''2'' + time ''12:49'', 535.30, 13, 50.0),
            (36, ''Олонецкая улица, 15'', ST_SetSRID(ST_MakePoint(37.617642, 55.852527), 4326), 4, 66, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''12:50'', CURRENT_DATE - integer ''2'' + time ''13:37'', 361.60, NULL, 0),
            (37, ''Олонецкая улица, 15'', ST_SetSRID(ST_MakePoint(37.617643, 55.852526), 4326), 4, 66, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''13:40'', CURRENT_DATE - integer ''2'' + time ''14:21'', 734.96, NULL, 0),
            (38, ''Олонецкая улица, 15'', ST_SetSRID(ST_MakePoint(37.617644, 55.852525), 4326), 4, 66, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''14:24'', CURRENT_DATE - integer ''2'' + time ''15:10'', 426.41, NULL, 0),

            (39, ''Олонецкая улица, 15'', ST_SetSRID(ST_MakePoint(37.617645, 55.852524), 4326), 4, 67, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''18:12'', CURRENT_DATE - integer ''3'' + time ''18:50'', 892.10, 14, 50.0),
            (40, ''Олонецкая улица, 15'', ST_SetSRID(ST_MakePoint(37.617646, 55.852523), 4326), 4, 67, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''18:52'', CURRENT_DATE - integer ''3'' + time ''19:36'', 367.90, NULL, 0),
            (41, ''Олонецкая улица, 15'', ST_SetSRID(ST_MakePoint(37.617647, 55.852522), 4326), 4, 67, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''19:39'', CURRENT_DATE - integer ''3'' + time ''20:26'', 922.70, NULL, 0),
            (42, ''Олонецкая улица, 15'', ST_SetSRID(ST_MakePoint(37.617648, 55.852521), 4326), 4, 67, ''CANCELLED'', CURRENT_DATE - integer ''3'' + time ''20:29'', CURRENT_DATE - integer ''3'' + time ''20:44'', 378.60, NULL, 0),
            (43, ''Олонецкая улица, 15'', ST_SetSRID(ST_MakePoint(37.617640, 55.852520), 4326), 4, 67, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''20:53'', CURRENT_DATE - integer ''3'' + time ''21:35'', 393.10, NULL, 0),

            -- заказы с восточного склада

            (44, ''Свободный проспект, 6к3'', ST_SetSRID(ST_MakePoint(37.816477, 55.758412), 4326), 5, NULL, ''CANCELLED'', CURRENT_DATE - integer ''3'' + time ''10:32'', CURRENT_DATE - integer ''3'' + time ''10:33'', 555.50, 15, 50.0),
            (46, ''Свободный проспект, 6к3'', ST_SetSRID(ST_MakePoint(37.816478, 55.758413), 4326), 5, 68,   ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''10:23'', CURRENT_DATE - integer ''3'' + time ''11:01'', 1249.40, NULL, 0),
            (47, ''Свободный проспект, 6к3'', ST_SetSRID(ST_MakePoint(37.816479, 55.758414), 4326), 5, 68,   ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''11:03'', CURRENT_DATE - integer ''3'' + time ''11:49'', 347.30, NULL, 0),
            (48, ''Свободный проспект, 6к3'', ST_SetSRID(ST_MakePoint(37.816470, 55.758415), 4326), 5, 68,   ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''16:13'', CURRENT_DATE - integer ''1'' + time ''16:46'', 594.00, NULL, 0),
            (49, ''Свободный проспект, 6к3'', ST_SetSRID(ST_MakePoint(37.816471, 55.758416), 4326), 5, 68,   ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''16:49'', CURRENT_DATE - integer ''1'' + time ''17:30'', 373.70, 16, 50.0),

            (50, ''Свободный проспект, 6к3'', ST_SetSRID(ST_MakePoint(37.816472, 55.758417), 4326), 5, 69, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''19:31'', CURRENT_DATE - integer ''3'' + time ''20:13'', 564.70, NULL, 0),
            (51, ''Свободный проспект, 6к3'', ST_SetSRID(ST_MakePoint(37.816473, 55.758418), 4326), 5, 69, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''20:17'', CURRENT_DATE - integer ''3'' + time ''20:52'', 530.90, 24, 10.0),
            (3 , ''Свободный проспект, 6к3'', ST_SetSRID(ST_MakePoint(37.816474, 55.758419), 4326), 5, 69, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''11:32'', CURRENT_DATE - integer ''2'' + time ''12:20'', 571.10, NULL, 0),
            (4 , ''Свободный проспект, 6к3'', ST_SetSRID(ST_MakePoint(37.816475, 55.758410), 4326), 5, 69, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''12:24'', CURRENT_DATE - integer ''2'' + time ''13:04'', 650.80, NULL, 0),
            (5 , ''Свободный проспект, 6к3'', ST_SetSRID(ST_MakePoint(37.816476, 55.758411), 4326), 5, 69, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''13:09'', CURRENT_DATE - integer ''2'' + time ''13:51'', 652.60, NULL, 0),

            (6 , ''Кетчерская улица, 10'', ST_SetSRID(ST_MakePoint(37.827537, 55.743758), 4326), 5, 70, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''08:12'', CURRENT_DATE - integer ''3'' + time ''08:54'', 976.49, NULL, 0),
            (7 , ''Кетчерская улица, 10'', ST_SetSRID(ST_MakePoint(37.827538, 55.743759), 4326), 5, 70, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''08:57'', CURRENT_DATE - integer ''3'' + time ''09:39'', 208.59, NULL, 0),
            (8 , ''Кетчерская улица, 10'', ST_SetSRID(ST_MakePoint(37.827539, 55.743750), 4326), 5, 70, ''DELIVERED'', CURRENT_DATE - integer ''3'' + time ''09:42'', CURRENT_DATE - integer ''3'' + time ''10:25'', 354.80, NULL, 0),
            (9 , ''Кетчерская улица, 10'', ST_SetSRID(ST_MakePoint(37.827530, 55.743751), 4326), 5, 70, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''19:42'', CURRENT_DATE - integer ''1'' + time ''20:14'', 407.60, 24, 10.0),
            (10, ''Кетчерская улица, 10'', ST_SetSRID(ST_MakePoint(37.827531, 55.743752), 4326), 5, 70, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''20:18'', CURRENT_DATE - integer ''1'' + time ''20:57'', 765.60, NULL, 0),

            (11, ''Кетчерская улица, 10'', ST_SetSRID(ST_MakePoint(37.827532, 55.743753), 4326), 5, 71, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''13:22'', CURRENT_DATE - integer ''2'' + time ''13:56'', 580.10, NULL, 0),
            (12, ''Кетчерская улица, 10'', ST_SetSRID(ST_MakePoint(37.827533, 55.743754), 4326), 5, 71, ''DELIVERED'', CURRENT_DATE - integer ''2'' + time ''13:59'', CURRENT_DATE - integer ''2'' + time ''14:43'', 985.50, NULL, 0),
            (13, ''Кетчерская улица, 10'', ST_SetSRID(ST_MakePoint(37.827534, 55.743755), 4326), 5, 71, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''13:01'', CURRENT_DATE - integer ''1'' + time ''13:54'', 529.40, NULL, 0),
            (14, ''Кетчерская улица, 10'', ST_SetSRID(ST_MakePoint(37.827535, 55.743756), 4326), 5, 71, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''13:59'', CURRENT_DATE - integer ''1'' + time ''14:42'', 777.60, NULL, 0),
            (15, ''Кетчерская улица, 10'', ST_SetSRID(ST_MakePoint(37.827536, 55.743757), 4326), 5, 71, ''DELIVERED'', CURRENT_DATE - integer ''1'' + time ''14:45'', CURRENT_DATE - integer ''1'' + time ''15:33'', 374.50, NULL, 0);
        END IF;
END;
' language plpgsql;

DO ' DECLARE
BEGIN
    IF NOT EXISTS (SELECT 1 FROM orders_product_positions WHERE order_product_position_id = 1) THEN
        INSERT INTO orders_product_positions(order_id, product_position_id, amount, price)
        VALUES
            -- Заказы с центрального склада
            (1, 1, 1, 120.50),
            (1, 6, 1, 80.0),
            (1, 601, 1, 85.9),
            (1, 156, 2, 31.4),
            (2, 11, 1, 110.0),
            (2, 16, 1, 145.5),
            (2, 161, 1, 254.0),
            (2, 326, 1, 77.59),
            (3, 406, 1, 71.1),
            (3, 421, 1, 22.0),
            (3, 161, 1, 177.0),
            (3, 326, 1, 54.59),
            (4, 596, 1, 82.9),
            (4, 576, 1, 580.0),
            (4, 476, 1, 109.0),
            (4, 431, 1, 45.9),
            (5, 211, 1, 129.9),
            (5, 76, 1, 194.29),
            (5, 51, 1, 82.86),
            (5, 366, 1, 118.0),
            (6, 461, 1, 117.0),
            (6, 386, 1, 115.0),
            (6, 166, 1, 44.90),
            (6, 511, 1, 742.50),
            (7, 171, 2, 68.7),
            (7, 46, 3, 300.0),
            (7, 321, 1, 99.86),
            (7, 441, 1, 130.0),
            (7, 531, 1, 304.0),
            (8, 241, 1, 99.9),
            (8, 41, 1, 70.0),
            (8, 561, 1, 491.40),
            (8, 556, 1, 167.0),
            (8, 396, 1, 142.9),
            (9, 326, 1, 77.9),
            (9, 276, 1, 169.9),
            (9, 236, 1, 50.7),
            (9, 176, 1, 137.0),
            (9, 451, 1, 157.0),
            (10, 566, 1, 187.0),
            (10, 486, 1, 285.7),
            (10, 441, 1, 130.0),
            (10, 126, 1, 87.0),
            (11, 6, 2, 80.0),
            (11, 21, 1, 138.0),
            (11, 386, 1, 115.0),
            (11, 246, 1, 34.8),
            (12, 186, 1, 93.5),
            (12, 421, 3, 66.0),
            (12, 256, 1, 79.9),
            (13, 196, 1, 129.9),
            (13, 261, 1, 263.9),
            (13, 21, 1, 138.0),
            (13, 376, 1, 75.4),
            (14, 161, 1, 252.9),
            (14, 556, 1, 167.0),
            (14, 446, 2, 150.0),
            (14, 131, 1, 39.7),
            (15, 441, 1, 130.0),
            (15, 1, 1, 120.5),
            (15, 131, 1, 39.7),
            (15, 551, 1, 167.0),
            (16, 476, 1, 109.0),
            (16, 196, 1, 129.9),
            (16, 576, 1, 722.9),
            (16, 421, 1, 22.0),
            (17, 551, 1, 167.0),
            (17, 206, 1, 179.9),
            (17, 186, 1, 93.6),
            (17, 151, 1, 86.9),
            (18, 181, 1, 268.6),
            (18, 26, 1, 83.6),
            (18, 436, 1, 65.6),
            (18, 406, 1, 71.0),
            (19, 396, 1, 142.9),
            (19, 296, 1, 175.0),
            (19, 311, 1, 84.9),
            (19, 506, 1, 282.0),
            (20, 351, 1, 157.0),
            (20, 426, 1, 64.0),
            (20, 376, 1, 75.4),
            (20, 571, 2, 253.0),
            -- Заказы с южного склада
            (21, 367, 1, 118.0),
            (21, 82, 1, 190.0),
            (21, 407, 1, 71.0),
            (21, 322, 1, 99.9),
            (22, 527, 1, 381.0),
            (22, 382, 1, 132.9),
            (22, 277, 1, 169.9),
            (22, 542, 1, 238.60),
            (23, 517, 1, 726.60),
            (23, 552, 1, 167.60),
            (23, 527, 1, 381.0),
            (23, 102, 1, 41.20),
            (24, 122, 1, 87.10),
            (24, 242, 1, 99.9),
            (24, 17, 1, 145.5),
            (24, 437, 1, 65.6),
            (25, 317, 1, 119.9),
            (25, 307, 1, 98.6),
            (25, 72, 1, 188.6),
            (25, 197, 1, 129.9),
            (26, 537, 1, 550.0),
            (26, 517, 1, 726.6),
            (26, 407, 1, 71.0),
            (26, 587, 1, 109.0),
            (27, 572, 1, 253.0),
            (27, 532, 1, 304),
            (27, 67, 1, 82.9),
            (27, 137, 1, 37.9),
            (28, 42, 1, 70.0),
            (28, 482, 1, 500.0),
            (28, 127, 1, 87.10),
            (28, 557, 1, 167.0),
            (29, 452, 1, 157.1),
            (29, 427, 1, 64.3),
            (29, 12, 1, 110.0),
            (29, 277, 1, 169.9),
            (30, 162, 1, 252.9),
            (30, 122, 1, 87.1),
            (30, 447, 1, 150.0),
            (30, 182, 1, 268.5),
            (31, 437, 1, 65.0),
            (31, 357, 1, 271.0),
            (31, 337, 1, 157.1),
            (31, 192, 1, 149.9),
            (32, 232, 1, 55.0),
            (32, 352, 1, 157.1),
            (32, 412, 1, 59.0),
            (32, 162, 1, 252.0),
            (33, 572, 1, 252.0),
            (33, 542, 1, 238.0),
            (33, 452, 1, 157.0),
            (33, 557, 1, 167.0),
            (34, 142, 1, 51.9),
            (34, 257, 1, 79.9),
            (34, 552, 1, 167.0),
            (34, 487, 1, 285.0),
            (35, 222, 1, 30.8),
            (35, 182, 1, 268.5),
            (35, 532, 1, 304.0),
            (35, 342, 1, 142.8),
            (36, 507, 1, 282.0),
            (36, 297, 1, 175.0),
            (36, 152, 1, 86.0),
            (36, 72, 1, 188.5),
            (37, 517, 1, 726.6),
            (37, 397, 1, 142.8),
            (37, 332, 1, 141.8),
            (37, 412, 1, 59.0),
            (38, 412, 1, 59.0),
            (38, 342, 1, 142.8),
            (38, 212, 1, 129.8),
            (38, 27, 1, 83.5),
            (39, 142, 1, 51.9),
            (39, 572, 1, 253.0),
            (39, 252, 1, 119.9),
            (39, 477, 1, 109.0),
            (40, 277, 1, 169.9),
            (40, 57, 1, 70.0),
            (40, 27, 1, 83.0),
            (40, 202, 1, 109.9),
            (41, 357, 1, 271.0),
            (41, 47, 1, 100.0),
            (41, 257, 1, 79.9),
            (41, 227, 1, 85.0),
            (42, 57, 1, 70.0),
            (42, 572, 1, 253.0),
            (42, 327, 1, 77.9),
            (42, 257, 1, 79.9),
            (43, 322, 1, 99.9),
            (43, 397, 1, 142.9),
            (43, 212, 1, 129.9),
            (43, 582, 1, 214.0),
            (44, 472, 1, 108.0),
            (44, 522, 1, 392.0),
            (44, 477, 1, 109.0),
            (44, 342, 1, 142.9),
            (45, 2, 1, 120.5),
            (45, 582, 1, 214.0),
            (45, 307, 1, 98.5),
            (45, 412, 1, 59.0),
            (46, 217, 1, 269.9),
            (46, 147, 1, 96.9),
            (46, 317, 1, 119.9),
            (46, 452, 1, 157.0),
            -- заказы с западного склада
            (47, 363, 1, 242.0),
            (47, 193, 1, 149.9),
            (47, 283, 1, 169.9),
            (47, 168, 1, 44.9),
            (48, 568, 1, 187.0),
            (48, 28, 1, 83.0),
            (48, 228, 1, 85.0),
            (48, 13, 1, 110.0),
            (49, 528, 1, 381.0),
            (49, 478, 1, 109.0),
            (49, 238, 1, 50.7),
            (49, 553, 1, 167.0),
            (50, 313, 1, 84.9),
            (50, 143, 1, 51.9),
            (50, 193, 1, 149.9),
            (50, 153, 1, 86.9),
            (51, 493, 1, 314.0),
            (51, 348, 1, 185.8),
            (51, 563, 1, 491.4),
            (51, 363, 1, 242.7),
            (52, 498, 1, 284.0),
            (52, 158, 1, 62.7),
            (52, 488, 1, 285.0),
            (52, 558, 1, 167.0),
            (53, 238, 1, 50.7),
            (53, 583, 1, 214.0),
            (53, 418, 1, 79.9),
            (53, 443, 1, 130.0),
            (54, 193, 1, 149.9),
            (54, 528, 1, 381.0),
            (54, 143, 1, 51.9),
            (54, 73, 1, 188.6),
            (55, 223, 1, 30.9),
            (55, 243, 1, 99.9),
            (55, 518, 1, 726.6),
            (55, 388, 1, 115.0),
            (56, 368, 1, 118.0),
            (56, 428, 1, 64.0),
            (56, 173, 1, 68.7),
            (56, 278, 1, 169.9),
            (57, 478, 1, 109.0),
            (57, 598, 1, 89.9),
            (57, 403, 1, 62.0),
            (57, 498, 1, 284.0),
            (58, 373, 1, 99.9),
            (58, 268, 1, 49.9),
            (58, 78, 1, 194.0),
            (58, 483, 1, 500.0),
            (59, 513, 1, 742.5),
            (59, 308, 1, 98.6),
            (59, 518, 1, 726.6),
            (59, 338, 1, 157.0),
            (60, 598, 1, 89.9),
            (60, 288, 1, 199.9),
            (60, 463, 1, 117.0),
            (60, 458, 1, 75.0),
            (61, 153, 1, 86.8),
            (61, 328, 1, 77.99),
            (61, 273, 1, 191.0),
            (61, 373, 1, 99.9),
            -- заказы с северного склада
            (62, 424, 1, 22.0),
            (62, 129, 1, 87.10),
            (62, 579, 1, 722.9),
            (62, 434, 1, 65.6),
            (63, 184, 1, 268.6),
            (63, 454, 1, 157.1),
            (63, 354, 1, 157.1),
            (63, 554, 1, 167.0),
            (64, 169, 1, 44.9),
            (64, 419, 1, 79.9),
            (64, 469, 1, 96.6),
            (64, 254, 1, 119.9),
            (65, 269, 1, 44.9),
            (65, 349, 1, 185.7),
            (65, 539, 1, 550.0),
            (65, 374, 1, 99.9),
            (66, 579, 1, 722.9),
            (66, 339, 1, 157.1),
            (66, 514, 1, 742.5),
            (66, 419, 1, 79.9),
            (67, 164, 1, 252.9),
            (67, 69, 1, 82.9),
            (67, 374, 1, 99.9),
            (67, 54, 1, 82.9),
            (68, 589, 1, 109.0),
            (68, 174, 1, 68.7),
            (68, 539, 1, 550.0),
            (68, 369, 1, 118.0),
            (69, 484, 1, 500.0),
            (69, 49, 1, 100.0),
            (69, 84, 1, 190.0),
            (69, 189, 1, 93.6),
            (70, 474, 1, 108.4),
            (70, 194, 1, 149.9),
            (70, 529, 1, 381.0),
            (70, 14, 1, 110.0),
            (71, 504, 1, 749.0),
            (71, 29, 1, 83.6),
            (71, 454, 1, 157.1),
            (71, 539, 1, 550.0),
            (72, 434, 1, 65.6),
            (72, 324, 1, 99.9),
            (72, 219, 1, 269.9),
            (72, 194, 1, 149.9),
            (73, 479, 1, 109.0),
            (73, 239, 1, 50.7),
            (73, 394, 1, 142.9),
            (73, 414, 1, 59.0),
            (74, 74, 1, 188.6),
            (74, 469, 1, 96.6),
            (74, 209, 1, 179.9),
            (74, 219, 1, 269.86),
            (75, 259, 1, 79.9),
            (75, 349, 1, 185.71),
            (75, 384, 1, 132.9),
            (75, 94, 1, 27.9),
            (76, 79, 1, 194.0),
            (76, 184, 1, 268.6),
            (76, 129, 1, 87.10),
            (76, 524, 1, 392.4),
            (77, 604, 1, 85.9),
            (77, 139, 1, 37.9),
            (77, 19, 1, 145.5),
            (77, 309, 1, 98.6),
            (78, 529, 1, 381.0),
            (78, 294, 1, 185.0),
            (78, 489, 1, 285.7),
            (78, 409, 1, 71.0),
            (79, 254, 1, 119.9),
            (79, 54, 1, 82.9),
            (79, 69, 1, 82.9),
            (79, 149, 1, 92.9),
            (80, 474, 1, 108.0),
            (80, 19, 1, 145.5),
            (80, 374, 1, 99.9),
            (80, 134, 1, 39.7),
            -- заказы с восточного склада
            (81, 380, 1, 75.4),
            (81, 295, 1, 185.0),
            (81, 220, 1, 269.9),
            (81, 460, 1, 75.2),
            (82, 365, 1, 242.7),
            (82, 80, 1, 194.2),
            (82, 520, 1, 726.6),
            (82, 605, 1, 85.9),
            (83, 120, 1, 87.1),
            (83, 15, 1, 110.0),
            (83, 590, 1, 109.0),
            (83, 110, 1, 41.2),
            (84, 575, 1, 253.0),
            (84, 280, 1, 169.9),
            (84, 110, 1, 41.2),
            (84, 200, 1, 129.9),
            (85, 375, 1, 99.9),
            (85, 200, 1, 129.9),
            (85, 480, 1, 109.0),
            (85, 315, 1, 84.9),
            (86, 325, 1, 99.9),
            (86, 425, 1, 22.0),
            (86, 490, 1, 285.7),
            (86, 185, 1, 157.1),
            (87, 290, 1, 199.9),
            (87, 390, 1, 115.0),
            (87, 415, 1, 59.0),
            (87, 560, 1, 167.0),
            (88, 285, 1, 169.9),
            (88, 355, 1, 157.1),
            (88, 105, 1, 41.2),
            (88, 90, 1, 202.9),
            (89, 45, 1, 70.0),
            (89, 150, 1, 96.9),
            (89, 535, 1, 304.0),
            (89, 210, 1, 179.9),
            (90, 545, 1, 238.6),
            (90, 535, 1, 304.0),
            (90, 100, 1, 30.0),
            (90, 10, 1, 80.0),
            (91, 260, 1, 79.9),
            (91, 185, 1, 268.6),
            (91, 330, 1, 77.99),
            (91, 540, 1, 550.0),
            (92, 330, 1, 77.99),
            (92, 100, 1, 30.0),
            (92, 140, 1, 37.9),
            (92, 160, 1, 62.7),
            (93, 175, 1, 68.7),
            (93, 390, 1, 115.0),
            (93, 200, 1, 129.9),
            (93, 110, 1, 41.2),
            (94, 215, 1, 129.9),
            (94, 605, 1, 85.9),
            (94, 195, 1, 149.9),
            (94, 145, 1, 51.9),
            (95, 220, 1, 269.9),
            (95, 210, 1, 179.9),
            (95, 145, 1, 51.9),
            (95, 265, 1, 263.9),
            (96, 310, 1, 98.6),
            (96, 175, 1, 68.7),
            (96, 400, 1, 142.9),
            (96, 220, 1, 269.9),
            (97, 435, 1, 65.6),
            (97, 100, 1, 30.0),
            (97, 580, 1, 722.9),
            (97, 555, 1, 167.0),
            (98, 80, 1, 194.3),
            (98, 180, 1, 137.1),
            (98, 10, 1, 80.0),
            (98, 370, 1, 118.0),
            (99, 550, 1, 298.5),
            (99, 10, 1, 80.0),
            (99, 495, 1, 314.2),
            (99, 315, 1, 84.9),
            (100, 335, 1, 141.8),
            (100, 160, 1, 62.7),
            (100, 55, 1, 82.9),
            (100, 130, 1, 87.1);
    END IF;
END;
' language plpgsql;

DO ' DECLARE
BEGIN
    IF NOT EXISTS (SELECT 1 FROM delivery_sessions WHERE delivery_session_id = 1) THEN
        INSERT INTO delivery_sessions(courier_id, start_time, end_time, orders_completed, average_time_per_order, money_earned)
        SELECT courier_id, date_start, date_end, 1, (date_end - date_start)::INTERVAL, ROUND(overall_cost / 10, 2) FROM orders WHERE (courier_id IS NOT NULL AND status = ''DELIVERED'') ORDER BY courier_id ASC;
        INSERT INTO delivery_sessions(courier_id, start_time, end_time, orders_completed, average_time_per_order, money_earned)
        SELECT courier_id, date_start, date_end, 1, (date_end - date_start)::INTERVAL, 0.0 FROM orders WHERE (courier_id IS NOT NULL AND status = ''CANCELLED'') ORDER BY courier_id ASC;
    END IF;
END;
' language plpgsql;

DO ' DECLARE
BEGIN
    IF NOT EXISTS (SELECT 1 FROM messages WHERE message_id=1) THEN
            INSERT INTO messages
            	VALUES 	(1, null, 2, ''2021-10-28 10:01:25'',
            				''Доброго дня! Привезли прокисшее молоко, очень разочарован!'',
            				null, TRUE),
            			(2, 77, 2, ''2021-10-28 10:31:42'',
            				''Здравствуйте, нам очень жаль, сегодня же заменим продукт. Курьер с Вами свяжется.'',
            				null, TRUE),
            			(3, null, 2, ''2021-10-28 10:37:15'', 
            				''Понял, буду ждать.'',
            				null, TRUE),
            			(4, 77, 2, ''2021-10-28 18:38:22'',
            				''Еще раз здравствуйте, доставили Вам замену товара?'',
            				null, TRUE),
            			(5, null, 2, ''2021-10-29 10:03:43'',
            				''Да, теперь все нормально, но первое впечатление было испорчено...'',
            				null, TRUE),
            			(6, 77, 2, ''2021-10-29 10:45:22'',
            				''Понимаем, будем исправляться и улучшать сервис для Вас!'',
            				null, FALSE),
            
            			(7, null, 3, ''2021-10-30 11:32:22'',
            				''Здравствуйте, сделал заказ утром в 9:31, но до сих пор мне даже не назначили курьера. 
            				Прошло 2 часа. Можете подсказать статус?'',
            				null, TRUE),
            			(8, 78, 3, ''2021-10-30 11:38:19'',
            				''Доброго дня. Сейчас огромная загруженность, но в течении 10 минут Вам назначат курьера, после завершения предыдущего заказа. Спасибо за понимание.'',
            				null, TRUE),
            			(9, null, 3, ''2021-10-30 11:39:02'',
            				''Понятно, буду ждать, спасибо за информацию.'',
            				null, TRUE),
            
            
            			(10, null, 4, ''2021-10-25 15:38:51'',
            				''Доброго времени суток. Курьер, видимо. уронил все содержимое заказа. Все упавковки, фрукты, овощи помяты и некоторые даже раздавлены! Хочу вернуть свои деньги.'',
            				null, TRUE),
            			(11, 79, 4, ''2021-10-25 15:43:25'',
            				''Здравствуйте, пониманием Ваше недовольство. С курьером проведем беседу, а для возврата средств нам необходимы фотографии чека и состояния продуктов.'',
            				null, TRUE),
            			(12, null, 4, ''2021-10-25 15:45:10'',
            				''В течении получаса предоставлю все необходимое. После этого когда я смогу получить свои деньги?'',
            				null, TRUE),
            			(13, 79, 4, ''2021-10-25 15:51:49'',
            				''После просмотра материалов деньги отправляем сразу же, но поступить на счет они могут в течении 3 рабочих дней.'',
            				null, TRUE),
            
            			(14, null, 5, ''2021-11-01 13:52:19'',
            				''По заказу претензий нет, но хотелось бы увидеть в ассортименте готовые блюда, с удовольствием бы заказал.'',
            				null, TRUE),
            			(15, 80, 5, ''2021-11-01 14:01:27'',
            				''Здравствуйте, спасибо за обратную связь! Наша сеть только развивается, поэтому такой ограниченный выбор. Ваше предложение передал руководству. Хорошего дня и приятных покупок!'',
            				null, TRUE),
            			(16, null, 5, ''2021-11-01 14:12:35'',
            				''Спасибо, если такое возможно, хотелось бы получить уведомление о расширении ассортимента, где такую информацию могу получить?'',
            				null, TRUE),
            			(17, 80, 5, ''2021-11-01 14:23:12'',
            				''Вы можете следить за новостями в нашем телеграмм канале!'',
            				null, TRUE),
            
            			(18, null, 6, ''2021-11-02 03:00:08'',
            				''Доброй ночи! Всегда заказываю у вас цельное молоко, но сегодня мне привезли что-то непонятное. Вкус слишком разбавленный, прошу проверить товар и вернуть деньги.'',
            				null, TRUE),
            			(19, 81, 6, ''2021-11-02 06:04:12'',
            				''Доброе утро! Спасибо за ожидание, специалисты проверяли партию из Вашего заказа. Действительно, выявили брак, сняли всю партию с продажи. Деньги вернуться в течении трех дней.'',
            				null, TRUE),
            			(20, null, 6, ''2021-11-02 08:19:51'',
            				''Радует хоть то, что после меня этот ужас больше никто не попробует.'',
            				null, TRUE),
            
            			(21, null, 7, ''2021-11-02 15:15:42'',
            				''Не могу удалить позицию из корзины. Выдается ошибка, что делать?'',
            				null, TRUE),
            			(22, 80, 7, ''2021-11-02 15:20:27'',
            				''Добрый день! Подскажите какую конкретную позицию, а также прошу прислать скриншот ошибки'',
            				null, TRUE),
            			(23, null, 7, ''2021-11-02 15:35:27'',
            				''Позиция: Кефир 2,5%, скриншот, к сожалению, прислать не могу. Что делать?'',
            				null, TRUE),
            			(24, 80, 7, ''2021-11-02 15:48:00'',
            				''В таком случае попробуйте перезайти в свой профиль. При повторном входе корзина должна быть пустой.'',
            				null, TRUE),
            			(25, null, 7, ''2021-11-02 15:50:51'',
            				''Это все прекрасно, но у меня большое количество товаров уже выбрано, для меня этот вариант не подходит.'',
            				null, TRUE),
            			(26, 80, 7, ''2021-11-02 15:52:14'',
            				''Тогда попробуйте удалить товар через уменьшение количества позиций до нуля.'',
            				null, FALSE),
            
            			(27, null, 8, ''2021-11-03 19:48:29'',
            				''Добрый вечер, мне нахамил курьер, когда я позвонил ему по телефону для уточнения времени доставки.'',
            				null, TRUE),
            			(28, 77, 8, ''2021-11-03 19:56:33'',
            				''Добрый вечер, передам инфомрацию специалистам по набору персонала. По результатам отпишусь.'',
            				null, TRUE),
            			(29, null, 8, ''2021-11-03 19:59:33'',
            				''Хорошо'',
            				null, TRUE),
            			(30, 78, 8, ''2021-11-04 10:38:41'',
            				''Доброе утро, отработали по Вашему обращению, с данным курьером наша сеть больше не сотрудничает. Спасибо за обратную связь, будем продолжать улучшение сервиса!'',
            				null, TRUE),
            			(31, null, 8, ''2021-11-04 12:02:08'',
            				''Здравствуйте, спасибо за принятие оперативных мер.'',
            				null, FALSE),
            
            			(32, null, 9, ''2021-11-04 11:17:51'',
            				''Нравится Ваш сервис. Не думали над разработкой мобильного приложения? А то с телефона в браузере иногда тупит. Спасибо.'',
            				null, TRUE),
            			(33, 79, 9, ''2021-11-04 11:30:11'',
            				''Доброго дня, от лица нашей сети благодарю Вас за отзыв. По поводу мобильного приложения вопрос будет передан руководству. Обо всех нововведениях можете следить в нашем телеграм канале!'',
            				null, TRUE),
            
            			(34, null, 10, ''2021-11-05 02:31:55'',
            				''Подскажите, зачем сервис делать круглосуточным, если ночью заказы не доставляют? Даже курьера не назначают...'',
            				null, TRUE),
            			(35, 81, 10, ''2021-11-05 02:35:12'',
            				''Доброй ночи! Взяли на контроль Ваш заказ, ищем курьера, Спасибо за понимание.'',
            				null, TRUE),
            			(36, null, 10, ''2021-11-05 02:37:51'',
            				''Нет уж, отменяйте мой заказ и верните деньги. Закажу в другом месте.'',
            				null, TRUE),
            			(37, 81, 10, ''2021-11-05 02:43:12'',
            				''Просим прощения за доставленные неудобства. Заказ отменили, но может Вы предоставите нам шанс в будущем? А для этого мы предлагаем Вам персональный промокод на 150 рублей просто введите ВТОРОЙШАНС.'',
            				null, TRUE),
            
            			(38, null, 11, ''2021-11-07 21:26:22'',
            				''Добрый вечер! Никакого негатива, все очень понравилось, интерфейс понятный, заказала, все быстро доставили с продуктами тоже полный порядок!'',
            				null, TRUE),
            			(39, 77, 11, ''2021-11-07 21:32:51'',
            				''Здравствуйте, мы очень рады Вашему положительному опыту! Будем продолжать развивать сервис для Вас!'',
            				null, TRUE),
            			(40, null, 11, ''2021-11-07 21:32:51'',
            				''Реально молодцы, продолжайте в том духе!'',
            				null, TRUE),
            			(41, 77, 11, ''2021-11-07 21:38:39'',
            				''Спасибо, Вы также можете подписаться на наш канал в телеграме. Там выходят все новости по поводу работы нашей сети.'',
            				null, TRUE),
            			(42, null, 11, ''2021-11-07 21:45:22'',
            				''Спасибо, обязательно подпишусь!'',
            				null, FALSE);
        ALTER SEQUENCE IF EXISTS messages_message_id_seq RESTART WITH 42;
        END IF;
END;
' LANGUAGE PLPGSQL;